Repository: vecnathewhisperd0/fdroid-website
Catalog: po/_pages.*.po
Languages: te

source: 403 Forbidden
te: 403 నిషేధించబడింది

source: If you think there should be something here, please [submit an issue](https://gitlab.com/fdroid/fdroid-website/issues).
te: ఇక్కడ ఏదో ఉండాలి అని మీరు అనుకుంటే, దయచేసి [సమస్యను సమర్పించండి]

source: 404 Page Not Found
te: 404 పేజి దొరకలేదు

source: About
te: గురించి

source: F-Droid is a robot with a passion for Free and Open Source (FOSS) software on the Android platform. On this site you’ll find a repository of FOSS apps, along with an Android client to perform installations and updates, and news, reviews and other features covering all things Android and software-freedom related.
te: ఆండ్రాయిడ్ ప్లాట్‌ఫామ్‌లో ఫ్రీ అండ్ ఓపెన్ సోర్స్ (ఫాస్) సాఫ్ట్‌వేర్ పట్ల అభిరుచి ఉన్న రోబోట్ ఎఫ్-డ్రాయిడ్. ఈ సైట్‌లో మీరు సంస్థాపనలు మరియు నవీకరణలను నిర్వహించడానికి Android క్లయింట్‌తో పాటు FOSS అనువర్తనాల రిపోజిటరీని మరియు Android మరియు సాఫ్ట్‌వేర్-స్వేచ్ఛకు సంబంధించిన అన్ని విషయాలను కవర్ చేసే వార్తలు, సమీక్షలు మరియు ఇతర లక్షణాలను కనుగొంటారు.

source: The _f-droid.org_ core infrastructure is operated by F-Droid Limited, a UK "private company" registered in England (no. [08420676](https://beta.companieshouse.gov.uk/company/08420676)).
te: _F-droid.org_ కోర్ మౌలిక సదుపాయాలు ఇంగ్లాండ్‌లో నమోదు చేయబడిన UK "ప్రైవేట్ సంస్థ" అయిన F- డ్రాయిడ్ లిమిటెడ్ (నం. [08420676](https://beta.companieshouse.gov.uk/company/08420676) చేత నిర్వహించబడుతుంది.

source: Contact
te: పరిచయం

source: You can discuss F-Droid or get help on the [forum](https://forum.f-droid.org) and F-Droid's user chat.
te: మీరు ఎఫ్-డ్రాయిడ్ గురించి చర్చించవచ్చు లేదా [ఫోరమ్](https://forum.f-droid.org) మరియు ఎఫ్-డ్రాయిడ్ యొక్క యూజర్ చాట్‌లో సహాయం పొందవచ్చు.

source: To chat with others about F-Droid, either join via IRC in the [#fdroid channel](https://webchat.freenode.net/?channels=%23fdroid) on freenode or join [#fdroid:f-droid.org](https://matrix.to/#/#fdroid:f-droid.org) on Matrix. The discussions are logged on [view.matrix.org](https://view.matrix.org/alias/%23fdroid:f-droid.org).
te: F-Droid గురించి ఇతరులతో చాట్ చేయడానికి, ఫ్రీనోడ్‌లోని [#fdroid ఛానెల్](https://webchat.freenode.net/?channels=%23fdroid) లో IRC ద్వారా చేరండి లేదా [#fdroid:f-droid.org](https://matrix.to/#/#fdroid:f-droid.org) మ్యాట్రిక్స్లో. చర్చలు [view.matrix.org](https://view.matrix.org/alias/%23fdroid:f-droid.org) లో లాగిన్ అయ్యాయి.

source: There also exist bridges to Telegram and Jabber/XMPP (experimental). To join via Telegram, click on [this link](https://matrix.f-droid.org/fdroid/telegram/). For Jabber/XMPP, join [#fdroid#matrix.org@bridge.xmpp.matrix.org](xmpp:#fdroid#matrix.org@bridge.xmpp.matrix.org?join).
te: టెలిగ్రామ్ మరియు జబ్బర్ / ఎక్స్‌ఎంపిపి (ప్రయోగాత్మక) కు వంతెనలు కూడా ఉన్నాయి. టెలిగ్రామ్ ద్వారా చేరడానికి, [ఈ లింక్](https://matrix.f-droid.org/fdroid/telegram/) పై క్లిక్ చేయండి. జబ్బర్ / XMPP కోసం, [#fdroid#matrix.org@bridge.xmpp.matrix.org] లో చేరండి (xmpp: #fdroid#matrix.org@bridge.xmpp.matrix.org? చేరండి).

source: You can send email at [team@f-droid.org](mailto:team@f-droid.org), but messages are much more likely to be answered on the forum or #fdroid channel. If you want to help, you can [join us]({{ "/contribute/" | prepend: site.baseurl }}).
te: మీరు [team@f-droid.org](mailto:team@f-droid.org) వద్ద ఇమెయిల్ పంపవచ్చు, కాని ఫోరమ్ లేదా #fdroid ఛానెల్‌లో సందేశాలకు సమాధానం లభించే అవకాశం ఉంది. మీరు సహాయం చేయాలనుకుంటే, మీరు [మాతో చేరండి]({{ "/contribute/" | prepend: site.baseurl }}).

source: Consulting / Commercial Support
te: కన్సల్టింగ్ / వాణిజ్య మద్దతు

source: If you're running an organisation that uses F-Droid or would like to use F-Droid, you will sometimes want to have an expert. For this, we have a list of companies and developers who contributed to F-Droid in one way or another and are available for consulting:
te: మీరు F-Droid ని ఉపయోగించే సంస్థను నడుపుతున్నట్లయితే లేదా F-Droid ని ఉపయోగించాలనుకుంటే, మీరు కొన్నిసార్లు నిపుణుడిని కలిగి ఉండాలని కోరుకుంటారు. దీని కోసం, ఎఫ్-డ్రాయిడ్‌కు ఒక విధంగా లేదా మరొక విధంగా సహకరించిన కంపెనీలు మరియు డెవలపర్‌ల జాబితా మన వద్ద ఉంది మరియు కన్సల్టింగ్ కోసం అందుబాటులో ఉంది:

source: License
te: లైసెన్సు

source: The source code for this site and the content produced by the F-Droid community are available under the [GNU Affero General Public License version 3 or later (AGPLv3+)](https://www.gnu.org/licenses/agpl-3.0.html).
te: ఈ సైట్ యొక్క సోర్స్ కోడ్ మరియు ఎఫ్-డ్రాయిడ్ సంఘం ఉత్పత్తి చేసిన కంటెంట్ [గ్నూ అఫెరో జనరల్ పబ్లిక్ లైసెన్స్ వెర్షన్ 3 లేదా తరువాత (AGPLv3)](https://www.gnu.org/licenses/agpl-3.0 .html).

source: The content of the news section and the F-Droid logo are also available under [Creative Commons Attribution-ShareAlike 3.0 License (CC-BY-SA-3.0)](http://creativecommons.org/licenses/by-sa/3.0/) or [GNU General Public License version 3 or later (GPLv3+)](https://www.gnu.org/licenses/gpl-3.0.html).
te: వార్తల విభాగం మరియు ఎఫ్-డ్రాయిడ్ లోగో యొక్క కంటెంట్ [క్రియేటివ్ కామన్స్ అట్రిబ్యూషన్-షేర్‌అలైక్ 3.0 లైసెన్స్ (CC-BY-SA-3.0)](http://creativecommons.org/licenses/by-sa/3.0 /) లేదా [గ్నూ జనరల్ పబ్లిక్ లైసెన్స్ వెర్షన్ 3 లేదా తరువాత (GPLv3)](https://www.gnu.org/licenses/gpl-3.0.html).

source: The descriptive text and graphics for each app have a specific license from that project. Free software should also have free descriptions and graphics.
te: ప్రతి అనువర్తనం యొక్క వివరణాత్మక టెక్స్ట్ మరియు గ్రాఫిక్స్కు ఆ ప్రాజెక్ట్ నుండి నిర్దిష్ట లైసెన్స్ ఉంటుంది. ఉచిత సాఫ్ట్‌వేర్‌లో ఉచిత వివరణలు మరియు గ్రాఫిక్స్ కూడా ఉండాలి.

source: The F-Droid logo was created by William Theaker. Updates to that, and additional artwork, are by Robert Martinez.
te: ఎఫ్-డ్రాయిడ్ లోగోను విలియం థికర్ రూపొందించారు. దానికి నవీకరణలు మరియు అదనపు కళాకృతులు రాబర్ట్ మార్టినెజ్ చేత.

source: Terms, etc.
te: నిబంధనలు, etc.

source: F-Droid is a non-profit [volunteer]({{ "/contribute/" | prepend: site.baseurl }}) project. Although every effort is made to ensure that everything in the repository is safe to install, you use it AT YOUR OWN RISK. Wherever possible, applications in the repository are built from source, and that source code is checked for potential security or privacy issues. This checking is far from exhaustive though, and there are no guarantees.
te: ఎఫ్-డ్రాయిడ్ ఒక లాభాపేక్షలేని [వాలంటీర్]({{ "/contribute/" | prepend: site.baseurl }}) ప్రాజెక్ట్. రిపోజిటరీలోని ప్రతిదీ వ్యవస్థాపించడానికి సురక్షితంగా ఉందని నిర్ధారించడానికి ప్రతి ప్రయత్నం చేసినప్పటికీ, మీరు దాన్ని మీ స్వంత ప్రమాదంలో ఉపయోగిస్తారు. సాధ్యమైన చోట, రిపోజిటరీలోని అనువర్తనాలు మూలం నుండి నిర్మించబడతాయి మరియు సంభావ్య భద్రత లేదా గోప్యతా సమస్యల కోసం ఆ సోర్స్ కోడ్ తనిఖీ చేయబడుతుంది. ఈ తనిఖీ సమగ్రమైనది అయినప్పటికీ, హామీలు లేవు.

source: F-Droid respects your privacy. We don’t track you, or your device. We don’t track what you install. You don’t need an account to use the client, and it sends no additional identifying data when talking to our web server other than its version number. We don’t even allow you to install other applications from the repository that track you, unless you first enable ‘Tracking’ in the AntiFeatures section of preferences. Any personal data you decide to give us (e.g. your email address when registering for an account to post on the forum) goes no further than us, and will not be used for anything other than allowing you to maintain your account.
te: F-Droid మీ గోప్యతను గౌరవిస్తుంది. మేము మిమ్మల్ని లేదా మీ పరికరాన్ని ట్రాక్ చేయలేము. మీరు ఇన్‌స్టాల్ చేసిన వాటిని మేము ట్రాక్ చేయము. క్లయింట్‌ను ఉపయోగించడానికి మీకు ఖాతా అవసరం లేదు, మరియు మా వెబ్ సర్వర్‌తో దాని వెర్షన్ నంబర్ కాకుండా మాట్లాడేటప్పుడు ఇది అదనపు గుర్తించే డేటాను పంపదు. మీరు ప్రాధాన్యతలను యాంటీ-ఫీచర్స్ విభాగంలో% u2018 ట్రాకింగ్% u2019 ను ప్రారంభించకపోతే, మిమ్మల్ని ట్రాక్ చేసే రిపోజిటరీ నుండి ఇతర అనువర్తనాలను వ్యవస్థాపించడానికి కూడా మేము మిమ్మల్ని అనుమతించము. మీరు మాకు ఇవ్వాలని నిర్ణయించుకున్న ఏదైనా వ్యక్తిగత డేటా (ఉదా. ఫోరమ్‌లో పోస్ట్ చేయడానికి ఖాతా కోసం నమోదు చేసేటప్పుడు మీ ఇమెయిల్ చిరునామా) మా కంటే ఎక్కువ కాదు మరియు మీ ఖాతాను నిర్వహించడానికి మిమ్మల్ని అనుమతించడం తప్ప మరేదైనా ఉపయోగించబడదు.

source: Contributors
te: రచనలు పంపేవారు

source: The F-Droid project was founded in 2010 by Ciaran Gultnieks, and is brought to you by at least the following people:
te: ఎఫ్-డ్రాయిడ్ ప్రాజెక్ట్ 2010 లో సియరాన్ గుల్ట్‌నిక్స్ చేత స్థాపించబడింది మరియు కనీసం ఈ క్రింది వ్యక్తుల ద్వారా మీ ముందుకు తీసుకురాబడింది:

source: Nico Alt
te: నికో ఆల్ట్

source: Laura Arjona
te: లారా అర్జోనా

source: Ben Arnold
te: బెన్ ఆర్నాల్డ్

source: Michele Azzolari
te: మైఖేల్ అజ్జోలారి

source: Danial Behzadi
te: డేనియల్ బెహ్జాది

source: Jan Berkel
te: జాన్ బెర్కెల్

source: David Black
te: డేవిడ్ బ్లాక్

source: Ruslan Boitsov
te: రుస్లాన్ బోయిట్సోవ్

source: Jan C Borchardt
te: జాన్ సి బోర్చార్డ్ట్

source: Valerio Bozzolan
te: వాలెరియో బోజోలన్

source: Dan Bravender
te: మరియు బ్రేవెండర్

source: Cédric Cabessa
te: సెడ్రిక్ కాబెస్సా

source: Kevin Cernekee
te: కెవిన్ సెర్నీకీ

source: Felix Edelmann
te: ఫెలిక్స్ ఎడెల్మాన్

source: Kevin Everets
te: కెవిన్ ఎవెరెట్స్

source: Alberto A. Fuentes
te: అల్బెర్టో ఎ. ఫ్యుఎంటెస్

source: Torsten Grote
te: టోర్స్టన్ ది గ్రేట్

source: Ciaran Gultnieks
te: సియరాన్ బెడ్

source: Tias Guns
te: టియాస్ గన్స్

source: Michael Haas
te: మైఖేల్ హాస్

source: Stefan Handschuh
te: స్టీఫన్ హ్యాండ్స్‌చుహ్

source: Marcus Hoffmann
te: మార్కస్ హాఫ్మన్

source: Kees Hulberts
te: కీస్ హల్బర్ట్స్

source: Ayron Jungren
te: ఐరన్ జంగర్

source: João Fernando C. Júnior
te: జోనో ఫెర్నాండో సి. జూనియర్

source: Neo Kolokotronis
te: నియో కోలోకోట్రోనిస్

source: Nikita Kozlov
te: నికితా కోజ్లోవ్

source: Matt Kraai
te: మాట్ క్రో

source: Daniel Kraft
te: డేనియల్ క్రాఫ్ట్

source: Boris Kraut
te: బోరిస్ హెర్బ్

source: Tobias Kuban
te: టోబియాస్ కుబన్

source: Mariotaku Lee
te: మారియోటాకు లీ

source: Leonardo De Luca
te: లియోనార్డో డి లూకా

source: Greg Lyle
te: గ్రెగ్ లైల్

source: Daniel Marti
te: డేనియల్ మార్టి

source: Robert Martinez
te: రాబర్ట్ మార్టినెజ్

source: Nat Meysenburg
te: నాట్ మేసెన్‌బర్గ్

source: Steven McDonald
te: స్టీవెన్ మెక్డొనాల్డ్

source: Andrew McMillan
te: ఆండ్రూ మెక్‌మిలన్

source: Andrew Nayenko
te: ఆండ్రూ నాయెంకో

source: Alex Oberhauser
te: అలెక్స్ ఒబెర్హౌజర్

source: Michael Pöhn
te: మైఖేల్ పాన్

source: Nicolas Raoul
te: నికోలస్ రౌల్

source: Fabian Rodriguez
te: ఫాబియన్ రోడ్రిగెజ్

source: Pierre Rudloff
te: పియరీ రుడ్లాఫ్

source: Florian Schmaus
te: ఫ్లోరియన్ ష్మాస్

source: Dominik Schürmann
te: డొమినిక్ షార్మాన్

source: Hans-Emil Skogh
te: హన్స్-ఎమిల్ స్కోగ్

source: Paul Sokolovsky
te: పాల్ సోకోలోవ్స్కీ

source: Graziano Sorbaioli
te: గ్రాజియానో సోర్బయోలి

source: Hans-Christoph Steiner
te: హన్స్-క్రిస్టోఫ్ స్టైనర్

source: David Sterry
te: డేవిడ్ స్టెర్రీ

source: Peter Serwylo
te: పీటర్ సెర్విలో

source: John Sullivan
te: జాన్ సుల్లివన్

source: Antonio Tapiador
te: ఆంటోనియో టాపిడార్

source: William Theaker
te: విలియం థికర్

source: Henrik Tunedal
te: హెన్రిక్ ట్యూనెడల్

source: Ivo Ugrina
te: ఐవో ఉగ్రినా

source: Matthias Weiler
te: మాథియాస్ వెయిలర్

source: Nutchanon Wetchasit
te: ఆంటోనియో టాపిడార్

source: Philipp Wollschlegel
te: ఫిలిప్ వోల్స్‌క్లెగెల్

source: If your name is missing, it’s a mistake and you should [add yourself to the list](https://gitlab.com/fdroid/fdroid-website/blob/master/_pages/about.md)! Keep it sorted by surname, please.
te: మీ పేరు తప్పిపోతే, అది పొరపాటు మరియు మీరు [మిమ్మల్ని జాబితాలో చేర్చండి](https://gitlab.com/fdroid/fdroid-website/blob/master/_pages/about.md)! దయచేసి ఇంటిపేరుతో క్రమబద్ధీకరించండి.

source: The original F-Droid client app was based on the Aptoide app developed by Roberto Jacinto.
te: అసలు ఎఫ్-డ్రాయిడ్ క్లయింట్ అనువర్తనం రాబర్టో జాసింటో అభివృద్ధి చేసిన ఆప్టోయిడ్ అనువర్తనం ఆధారంగా రూపొందించబడింది.

source: Consulting
te: కన్సల్టింగ్

source: If you're running an organisation that uses F-Droid or would like to use F-Droid, you will sometimes want to have an expert. This page is a list of companies and developers who contributed to F-Droid in one way or another and are available for consulting. By contracting one of these companies or developers, your organisation can also (indirectly) support the development of F-Droid.
te: మీరు F-Droid ని ఉపయోగించే సంస్థను నడుపుతున్నట్లయితే లేదా F-Droid ని ఉపయోగించాలనుకుంటే, మీరు కొన్నిసార్లు నిపుణుడిని కలిగి ఉండాలని కోరుకుంటారు. ఈ పేజీ ఎఫ్-డ్రాయిడ్‌కు ఒక విధంగా లేదా మరొక విధంగా సహకరించిన మరియు కన్సల్టింగ్ కోసం అందుబాటులో ఉన్న కంపెనీలు మరియు డెవలపర్‌ల జాబితా. ఈ కంపెనీలలో లేదా డెవలపర్‌లలో ఒకదానితో ఒప్పందం కుదుర్చుకోవడం ద్వారా, మీ సంస్థ ఎఫ్-డ్రాయిడ్ అభివృద్ధికి (పరోక్షంగా) మద్దతు ఇవ్వగలదు.

source: Keep in mind that the F-Droid ecosystem consists of several components. Thus, consulting services may offer a lot of different services, such as * Deployment of F-Droid within an organisation * Setup and maintenance of F-Droid repositories * Workshops for users and admins * Help in getting an app compliant for inclusion in the main f-droid.org repository * Bug fixes or feature additions to the F-Droid client and server components * Whitelabel solutions
te: ఎఫ్-డ్రాయిడ్ పర్యావరణ వ్యవస్థ అనేక భాగాలను కలిగి ఉంటుందని గుర్తుంచుకోండి. అందువల్ల, కన్సల్టింగ్ సేవలు చాలా విభిన్నమైన సేవలను అందించవచ్చు * ఒక సంస్థలో ఎఫ్-డ్రాయిడ్ యొక్క విస్తరణ * ఎఫ్-డ్రాయిడ్ రిపోజిటరీల ఏర్పాటు మరియు నిర్వహణ * వినియోగదారులు మరియు నిర్వాహకుల కోసం వర్క్‌షాప్‌లు * ప్రధాన f-droid.org రిపోజిటరీలో చేర్చడానికి అనువర్తనం కంప్లైంట్ పొందడంలో సహాయం * F-Droid క్లయింట్ మరియు సర్వర్ భాగాలకు బగ్ పరిష్కారాలు లేదా ఫీచర్ చేర్పులు * వైట్‌లేబుల్ పరిష్కారాలు

source: Check out the descriptions to find an appropriate consultant for your needs.
te: మీ అవసరాలకు తగిన కన్సల్టెంట్‌ను కనుగొనడానికి వివరణలను చూడండి.

source: __Website:__ [https://www.cotech.de/f-droid](https://www.cotech.de/f-droid)
te: __ వెబ్‌సైట్: __ [https://www.cotech.de/f-droid ](https://www.cotech.de/f-droid)

source: __Email:__ [contact@cotech.de](mailto:contact@cotech.de)
te: __ ఇమెయిల్: __ [contact@cotech.de](mailto:contact@cotech.de)

source: __Languages:__ English, German
te: __ భాషలు: __ ఇంగ్లీష్, జర్మన్

source: __Specializations:__ Custom F-Droid deployments, feature extensions, whitelabel solutions
te: __ ప్రత్యేకతలు: __ కస్టమ్ ఎఫ్-డ్రాయిడ్ విస్తరణలు, ఫీచర్ పొడిగింపులు, వైట్‌లేబుల్ పరిష్కారాలు

source: If you're missing, you can [add yourself to the list](https://gitlab.com/fdroid/fdroid-website/blob/master/_pages/consulting.md)! Keep it sorted alphabetically, please.
te: మీరు తప్పిపోయినట్లయితే, మీరు [మిమ్మల్ని జాబితాలో చేర్చవచ్చు](https://gitlab.com/fdroid/fdroid-website/blob/master/_pages/consulting.md)! దయచేసి అక్షరక్రమంగా క్రమబద్ధీకరించండి.

source: Contribute
te: సహకరించండి

source: The project is entirely developed and maintained by volunteers. You can help:
te: ఈ ప్రాజెక్ట్ పూర్తిగా స్వచ్ఛంద సేవకులచే అభివృద్ధి చేయబడింది మరియు నిర్వహించబడుతుంది. మీరు సహాయం చేయవచ్చు:

source: Report Problems
te: సమస్యలను నివేదించండి

source: If you experience problems with the site or client software, you can report them in the issue tracker (see below), or discuss them in the [Forum](https://forum.f-droid.org/) or on IRC (#fdroid on freenode).
te: మీరు సైట్ లేదా క్లయింట్ సాఫ్ట్‌వేర్‌తో సమస్యలను ఎదుర్కొంటే, మీరు వాటిని ఇష్యూ ట్రాకర్‌లో నివేదించవచ్చు (క్రింద చూడండి), లేదా వాటిని [ఫోరం](https://forum.f-droid.org/) లేదా IRC ( ఫ్రీనోడ్‌లో #fdroid).

source: For reporting issues, choose an appropriate tracker from the following:
te: సమస్యలను నివేదించడానికి, కింది వాటి నుండి తగిన ట్రాకర్‌ను ఎంచుకోండి:

source: [F-Droid client app](https://gitlab.com/fdroid/fdroidclient/issues)
te: [F-Droid క్లయింట్ అనువర్తనం](https://gitlab.com/fdroid/fdroidclient/issues)

source: [Server and build tools](https://gitlab.com/fdroid/fdroidserver/issues)
te: [సర్వర్ మరియు నిర్మాణ సాధనాలు](https://gitlab.com/fdroid/fdroidserver/issues)

source: [Official F-Droid repository metadata](https://gitlab.com/fdroid/fdroiddata/issues)
te: [అధికారిక ఎఫ్-డ్రాయిడ్ రిపోజిటరీ మెటాడేటా](https://gitlab.com/fdroid/fdroiddata/issues)

source: Submit Applications
te: దరఖాస్తులను సమర్పించండి

source: If you see an application missing from the repository (after reading the [inclusion policy](../docs/Inclusion_Policy)), please feel free to submit it via the dedicated [Requests For Packaging](https://gitlab.com/fdroid/rfp/issues) issue tracker.
te: రిపోజిటరీ నుండి ఒక అప్లికేషన్ తప్పిపోయినట్లు మీరు చూస్తే ([చేరిక విధానం](../docs/Inclusion_Policy) చదివిన తరువాత, దయచేసి దీన్ని అంకితమైన [ప్యాకేజింగ్ కోసం అభ్యర్థనలు](https://gitlab.com/) ద్వారా సమర్పించడానికి సంకోచించకండి. fdroid / rfp / issues) ఇష్యూ ట్రాకర్.

source: The same applies for helping to build newer versions of applications.
te: అనువర్తనాల యొక్క క్రొత్త సంస్కరణలను రూపొందించడంలో సహాయపడటానికి ఇది వర్తిస్తుంది.

source: Translate
te: అనువదించు

source: Help with Development
te: అభివృద్ధికి సహాయం చేయండి

source: Docs
te: డాక్స్

source: F-Droid is both a repository of verified free software Android apps as well as a whole "app store kit", providing all the tools needed to setup and run an app store. It is a community-run free software project developed by a wide range of contributors. It also includes complete build and release tools for managing the process of turning app source code into published builds.
te: ఎఫ్-డ్రాయిడ్ అనేది ధృవీకరించబడిన ఉచిత సాఫ్ట్‌వేర్ ఆండ్రాయిడ్ అనువర్తనాల రిపోజిటరీ మరియు మొత్తం "యాప్ స్టోర్ కిట్", ఇది అనువర్తన దుకాణాన్ని సెటప్ చేయడానికి మరియు అమలు చేయడానికి అవసరమైన అన్ని సాధనాలను అందిస్తుంది. ఇది విస్తృత శ్రేణి సహాయకులు అభివృద్ధి చేసిన కమ్యూనిటీ-నడిచే ఉచిత సాఫ్ట్‌వేర్ ప్రాజెక్ట్. అనువర్తన సోర్స్ కోడ్‌ను ప్రచురించిన బిల్డ్‌లుగా మార్చే విధానాన్ని నిర్వహించడానికి ఇది పూర్తి బిల్డ్ మరియు విడుదల సాధనాలను కలిగి ఉంటుంది.

source: The F-Droid server tools provide various scripts and tools that are used to maintain the main F-Droid application repository. You can use these same tools to create your own additional or alternative repository for publishing, or to assist in creating, testing and submitting metadata to the main repository.
te: ఎఫ్-డ్రాయిడ్ సర్వర్ సాధనాలు ప్రధాన ఎఫ్-డ్రాయిడ్ అప్లికేషన్ రిపోజిటరీని నిర్వహించడానికి ఉపయోగించే వివిధ స్క్రిప్ట్‌లు మరియు సాధనాలను అందిస్తాయి. ప్రచురణ కోసం మీ స్వంత అదనపు లేదా ప్రత్యామ్నాయ రిపోజిటరీని సృష్టించడానికి లేదా మెటాడేటాను ప్రధాన రిపోజిటరీకి సృష్టించడం, పరీక్షించడం మరియు సమర్పించడంలో సహాయపడటానికి మీరు ఇదే సాధనాలను ఉపయోగించవచ్చు.

source: Getting Started
te: మొదలు అవుతున్న

source: More Information
te: మరింత సమాచారం

source: Developers
te: డెవలపర్లు

source: Issues
te: సమస్యలు
