Repository: vecnathewhisperd0/fdroid-website
Catalog: po/_posts.*.po
Languages: bo, es, nb_no, zh_hant

source: ![]({{ site.baseurl }}/assets/posts/2017-07-03-cuba/fdroid_repo_categories.jpg)<br/> *A Screenshot of DroidT's app categories*
es: ![]({{ site.baseurl }}/assets/posts/2017-07-03-cuba/fdroid_repo_categories.jpg)<br/> 1 *Una foto de pantalla de las categorias de aplicaciones en DroidT's *

source: Another nice service they offer are app updates that are securely delivered by F-Droid. When somebody who has already downloaded apps from their repository, comes into the range of their WiFi again, F-Droid will check for updates and offer to install the ones that are available. This is a huge advantage in a country where people normally never care about updates at the expense of security.
es: Otro servicio que ofrecen es la actualizacion de aplicaciones realizada de manera segura unsando F-Droid. Cuando alguien que ha realizado descargas de su repositorio previamente esta en su rango de alcanze, F-Droid busca actualizaciones y ofrece instalar las que estan disponibles. Esta es una ventaja muy grande en un pais donde generalmente las personas no se preocupan por actualizaciones arriesgando su seguridad.

source: So it comes at no surprise that their slogan is "BE UPDATE" that even hangs in huge letters right above their desk in their shop. The repository by the way is hosted on the server that you can see directly above the banner with their slogan.
es: Por lo que no nos sorprende que su slogan sea " MANTENTE ACTUALIZADO " e incluso esta colgado en letras enorme arriba del escritorio de su tienda. Por cierto el repositorio esta hospedado en el servidor que puedes ver arriba de el letrero con su slogan.

source: It is great to see that the free technology that the F-Droid community worked on for so many years to liberate Android users is put to unexpected use by talented individuals in other countries like Cuba and helps to make a difference there.
es: Es increible ver como la tecnologia gratuita en la que la comunidad F-Droid trabajo por tantos años para liberar a los usuarios de Android ha sido aplicada a un uso inesperado por individuos talentosos en otros paises como Cuba y esta ayudando a hacer un cambio alli.

source: <hr />
es: <hr /> 1

source: For the sake of completeness however, it should be mentioned that ordinary downloads and F-Droid are not the only ways that Cubans use to get apps. There are weekly data packages that are sent through the country on hard-drives by bus. These <a href="https://en.wikipedia.org/wiki/El_Paquete_Semanal">Paquete Semanal</a> contain mostly movies and TV shows, but also news and apps.
es: Para ser completamente claros, debemos mensionar que las descargas ordinarias y F-Droid no son las unicas formas que los Cubanos usan para obtener aplicaciones. Existen paquetes de datos semanales que son enviados en autobus atravez del pais en discos duros. Este <a href="https://en.wikipedia.org/wiki/El_Paquete_Semanal"> 1 Paquete Semanal </a> 2 contiene en su mayoria peliculas y series de television, pero tambien nuevas aplicaciones.

source: Then, there is a proprietary app called <a href="https://en.wikipedia.org/wiki/Zapya">Zapya</a> that is very popular among young Cubans, because it allows them to wirelessly share apps and other files between two phones. Although F-Droid offers the same functionality, this is not yet widely known and currently being improved to match the simplicity that Zapya offers to Cubans at the moment.
es: Tambien, existe una aplicacion de software propietario llamada <a href="https://en.wikipedia.org/wiki/Zapya"> 1Zapya</a> 2 que es muy popular entre juvenes Cubanos, porque les permite compartir de manera inalambrica archivos y aplicaciones entre dos telefonos. Y aunque F-Droid ofrece la misma funcion, pero no muchos usuarios lo saben y esta siendo mejorado para igualar la simplicidad que Zapya ofrece a los Cubanos actualmente.

source: ![]({{ site.baseurl }}/assets/posts/2017-07-03-cuba/zapya_sharing.jpg)<br/> *A Cuban sharing apps with Zapya*
es: ![]({{ site.baseurl }}/assets/posts/2017-07-03-cuba/zapya_sharing.jpg)<br/> 1 *Un Cubano compartiendo aplicaciones con Zapya*

source: *This post was originally published on [blog.grobox.de/2017/how-f-droid-is-bringing-apps-to-cuba](https://blog.grobox.de/2017/how-f-droid-is-bringing-apps-to-cuba/).*
es: " Esta nota fue publicada originalmente en [blog.grobox.de/2017/how-f-droid-is-bringing-apps-to-cuba](https://blog.grobox.de/2017/how-f-droid-is-bringing-apps-to-cuba/).*

source: "F-Droid is 1.0!"
es: "F-Droid es 1.0!"

source: October 10th, 10-10, is the perfect day to announce F-Droid 1.0! After 7 years and the last year of intense development, we are ready to call the F-Droid ecosystem ready for prime time. We think that F-Droid is mature enough and ready for all users.
es: 10 de Octubre, 10-10, es el dia perfecto para anunciar F-Droid 1.0! Despues de 7 años y el año pasado de desarrollo intenso, estamos listos para llamar al ecosistema F-Droid listo y optimo. Pensamos que F-Droid es sufientemente maduro y listo para los usuarios.

source: With 60+ languages, 100+ contributors, 2500+ apps, and many millions of downloads, F-Droid is already widely used. It is even the default, built-in app store for two important Android ROM projects: [Replicant](https://www.replicant.us/) and [CopperheadOS](https://copperhead.co/android/).
es: Con 60+ Idiomas, 100+ colaboradores, 2500+aplicaciones y millones de descargas, F-Droid ya es usado en uchas partes. Incluso es la tienda de aplicaciones instalada por default en dos proyectos importantes de ROM para Android: [Replicant](https://www.replicant.us/) y [CopperheadOS](https://copperhead.co/android/).

source: F-Droid started out with a focus on providing verified free software in an Android app repository. That remains the core goal of the F-Droid community. We built a lot of software to achieve that goal, and along the way, we realized that F-Droid is also a complete "app store kit" that anyone could use. It also includes complete build and release tools for managing the process of turning app source code into published builds.
es: F-Droid empezo como un proyecto enfocado a proveer sofware gratuito y verificado en un repositorio de Android. " Y esa es aun la meta principal de la comunidad de F-Droid." Desarrollamos mucho software para lograrlo, y durante ese proceso nos dimos cuenta que F-Droid es tambien un " kit para una tienda de aplicaciones" completo que cualquiera puede usar. Ademas incluye herramientas completas de creacion y lanzamiento para administrar el proceso de convertir el codigo fuente de aplicaciones en desarrollos publicados.

source: What's New
es: Lo nuevo

source: There are many things that are new and improved in 1.0, so this post covers some highlights. In the user interface, there is a whole now architecture as well as a lot of new small improvements.
es: Hay muchas cosas nuevas y mejoradas en 1.0, asi que esta publicacion abarca las mas importantes. En la interfaz de usuario hay una arquitectura completamente nueva asi como muchas pequeñas mejoras .

source: apps can include [screenshots and feature graphics]({{ site.baseurl }}/docs/All_About_Descriptions_Graphics_and_Screenshots)
es: Las aplicaciones pueden incluir capturas de pantalla [screenshots and feature graphics]({{ site.baseurl }}/docs/All_About_Descriptions_Graphics_and_Screenshots)

source: donations to app developers highlighted on the App Details screen
es: Las donaciones a los desarrolladores de las aplicaciones estan resaltadas en la pantalla de detalles de la aplicacion

source: inline download/install buttons for quick installation
es: Descarga en linea/botones de instalacion para instalaciones rapidas

source: all app texts can be [translated]({{ site.baseurl }}/docs/Translation_and_Localization)
es: todos los textos de las aplicaciones pueden ser [translated]({{ site.baseurl }}/docs/Translation_and_Localization)

source: apps with [known security vulnerabilities](https://f-droid.org/wiki/page/AntiFeature:KnownVuln) will be marked
es: las aplicaciones con [vulnerabilidades de seguridad conocidas](https://f-droid.org/wiki/page/AntiFeature:KnownVuln) seran marcadas

source: F-Droid is now a first class app store
es: F-Droid es ahora una tienda de aplicaciones de primera clase

source: F-Droid can now be your only app store, fully integrated into your device with background updates and streamlined installs, all without sacrificing any of the privacy or security that F-Droid has always offered. F-Droid is already well known among those who install custom Android ROMs on their devices, and that is now much better supported via the F-Droid [Privileged Extension](https://f-droid.org/packages/org.fdroid.fdroid.privileged.ota), which can be flashed onto a device like any other OTA (Over-The-Air) update ZIP.
es: F-Droid puede ahora convertirse en tu única tienda de aplicaciones, completamente integrada en tu dispositivo con actualizaciones en el segundo plano e instalaciones optimizadas, todo esto sin sacrificar los ROMs de Android en los dispositivos, y ahora es mucho mejor soportado usando F-Droid [Privileged Extension](https://f-droid.org/packages/org.fdroid.fdroid.privileged.ota), que puede ser flasheado en otro dispositivo como cualquier otro OTA (Over-The-Air)-.

source: We will work with any ROM project to help them integrate F-Droid as the default app store, built into the ROM. See the [Privileged Extension instructions](https://gitlab.com/fdroid/privileged-extension/#how-do-i-build-it-into-my-rom) for how to get started.
es: Trabajaremos con cualquier proyecto de ROM para ayudarlos a integrar F-Droid como la tienda de aplicaciones predeterminada en el ROM. Ve [Privileged Extension instructions](https://gitlab.com/fdroid/privileged-extension/#how-do-i-build-it-into-my-rom) para saber como empezar.

source: F-Droid in your language
es: F-Droid en tu idioma

source: All parts of F-Droid are now translatable, including the app descriptions, website and the command line tools. They are already translated into many languages. Having free software available in people's native languages greatly reduces the barriers to entry. Look at the menu in the upper right of this website for the available languages.
es: Ahora todas las partes de F-Droid pueden ser traducidas, incluyendo las descripciones de las aplicaciones, sitio web y las herramientas de el comando de linea. Que ya estan traducidas en muchos lenguajes. Tener software gratuito disponible en los lenguajes nativos de la gente reduce muchas barreras de entrada. Ve el menu en la parte derecha de arriba de este sitio web para ver los lenguajes disponibles.

source: Is F-Droid not available in your language? Or would you like to help improve the existing translations? [Get involved!]({{ site.baseurl }}/docs/Translation_and_Localization)
es: ¿F-Droid no esta disponible en tu idioma? O ¿Te gustaria ayudarnos a mejorar las traducciones existentes? [Get involved!]({{ site.baseurl }}/docs/Translation_and_Localization)

source: F-Droid app
es: La aplicación F-Droid

source: _fdroidserver_ tools
es: herramientas _fdroidserver_

source: Run your own app "repo"
es: Ejecuta tu propio repositorio de aplicaciones

source: _f-droid.org_ is just one app repository (aka "repo") out of hundreds of repos created by individuals all around the globe. So whether you are a musician who wants to publish their music or a developer who wants to serve nightly builds of their app, you are free to create your own repo and share it with other people independently of F-Droid.org. F-Droid repos can now include any kind of file: apps, videos, audio, ebooks, ZIPs, etc
es: _f-droid.org_ es solamente un repositorio ( también llamado "repo" ) entre los miles de repositorios creados por personas alrededor del mundo. Así que no importa si eres un músico que quiere publicar su propia música o una desarrollador que quiere proporcionar compilaciones diarias de tus aplicaciones, eres libre de crear tu propio repositorio y compartirlo con otras personas de forma independiente de F-Droid. Los repositorios de F-Droid ahora pueden incluir cualquier clase de archivo: aplicaciones, videos, audio, libros electronicos. archivos comprimidos etc.

source: Anyone can make their own F-Droid repo using the _fdroidserver_ command line tools, the same as always. That requires knowledge of the command line, manual editing of "metadata" files to edit your packages’ store details, copying screenshots to the right directory, etc. Now with [Repomaker]({{ site.baseurl }}/repomaker), there is a simple web app to create repos, so special knowledge is no longer needed. More information on how to install Repomaker coming soon!
es: Caulquiera puede crear su propio repositorio en F-Droid usando las herramientas de linea de comando _fdroidserver_, igual que antes. Lo que requiere conocimiento de la linea de comandos, edicion manual de los metadatos de los archivos para editar tus paquetes, copiar las capturas de pantalla en el directorio correcto, etc. Ahora con [Repomaker]({{ site.baseurl }}/repomaker), hay una aplicacion web simple para crear repositorios, de manera que no es requerido conocimiento especializado . Mas informacion sobre como instalar Repomaker esta por venir!

source: There are also new options for publishing custom, hosted repos. Standard webservers and Amazon S3 have been supported for a while. Now you can also publish repos directly to GitLab or GitHub. On top of that, we have improved the _fdroidserver_ workflow when working with large collections of APKs, based on feedback from the developers of [Izzysoft](https://apt.izzysoft.de/fdroid/) and [Metro Tech & Solutions]({{ site.baseurl }}/2017/07/03/cuba.html).
es: Tambien hay opciones nuevas para publicar repositorios personalizados. Servidores estandares y Amazon S3 han sido soportados por algun tiempo. Ahora tambien puedes publicar repos directamente on GitLab y Github. Y ademas, hemos mejorado el flujo de trabajo de _fdroidserver_ cuando esta trabajando con una colección grande de APKs, basado en cometarios de los desarrolladores de [Izzysoft](https://apt.izzysoft.de/fdroid/) y [Metro Tech & Solutions]({{ site.baseurl }}/2017/07/03/cuba.html).

source: Join us!
es: Únete a nosotros!

source: Do you also want to see Android as a complete free software platform? Join us! There are many ways to [contribute]({{ site.baseurl }}/contribute).
es: ¿Quieres que Android se convierta en una plataforma de software completamente gratuito? Únete a nosotros! Hay muchas maneras de contribuir [contribute]({{ site.baseurl }}/contribute).

source: get [more apps](https://gitlab.com/fdroid/rfp/issues) built and included in _f-droid.org_
es: obten [more apps](https://gitlab.com/fdroid/rfp/issues) built and included in _f-droid.org_

source: test [nightly builds](https://gitlab.com/fdroid/fdroidclient-nightly)
es: Prueba [nightly builds](https://gitlab.com/fdroid/fdroidclient-nightly)

source: [translate]({{ site.baseurl }}/docs/Translation_and_Localization/) any part of F-Droid
es: [traduce]({{ site.baseurl }}/docs/Translation_and_Localization/) cualquier parte de F-Droid

source: [improve](https://gitlab.com/fdroid/fdroidserver/issues) the server side tools
es: [mejora](https://gitlab.com/fdroid/fdroidserver/issues) las herramientas alternativas del servidor

source: add [missing features](https://gitlab.com/fdroid/fdroidclient/issues) to the Android client
es: agrega [las funciones que faltan](https://gitlab.com/fdroid/fdroidclient/issues a el Cliente de Android

source: make [Repomaker](https://gitlab.com/fdroid/repomaker/issues) work well on your platform
es: Haz que [Repomaker](https://gitlab.com/fdroid/repomaker/issues) funcione bien en tu plataforma

source: If you are looking for a good place to get started, see the list of "[first timer](https://gitlab.com/groups/fdroid/issues?label_name%5B%5D=first-timer)" issues.
es: Si estas buscando un buen lugar para empezar, ve la lista de problemas de "[usuario nuevo](https://gitlab.com/groups/fdroid/issues?label_name%5B%5D=first-timer)".

source: "Publishing a nightly builds repo with GitLab or Travis CI"
es: " Publicando un repositorio de actualizaciones nocturnas en GitLAb o Travis CI"

source: Having users run "nightly" builds is a great way to get rapid feedback on current development activities. One key way to get this kind of feedback is to make it as easy as possible for people to install the nightly builds, and to keep updated. The F-Droid tools now let you automate this whole process for any app hosting on GitLab or GitHub, using a CI build service like gitlab-ci or Travis CI.
es: Tener usuarios ejecutando "nightly" builds es una buena manera de obtener comentarios rapidamente acerca de activideades de desarrollos actuales. Una forma clave de obtener este tipo de realimentacion es hacer tan facil como sea posible instalar the nightly builds, y permanecer actualizado. Ahora lass herramientas de F-Droid te dejan automatizar el proceso completo para cualquier hosting de aplicacion en GitLab or GitHub, usando un servicio CI como gitlab-ci o Travis CI.

source: The new `fdroid nightly` command automates the whole process of setting up and running this repo. The repo is then published to its own GitLab/GitHub git repo, where any F-Droid client can access it.
es: El comando nuevo `fdroid nightly`automatiza el proceso completo de configurar y ejecutar este repositorio. El repositorio es publicado entonces en su propio GitLab/GitHub git repositorio, donde cualquier cliente F-Droid puede accesarlo.

source: Learn how to set this up for your app by reading [Publishing Nightly Builds]({{ site.baseurl }}/docs/Publishing_Nightly_Builds). See it in action in _fdroidclient_: * <https://gitlab.com/fdroid/fdroidclient-nightly> * <https://gitlab.com/fdroid/fdroidclient/blob/5f26a785/.gitlab-ci.yml>
es: Aprende a configurar esta funcion para tu aplicacion leyendo lo siguiente: [Publishing Nightly Builds]({{ site.baseurl }}/docs/Publishing_Nightly_Builds). Miralo en accion en _fdroidclient_: * <https://gitlab.com/fdroid/fdroidclient-nightly> * <https://gitlab.com/fdroid/fdroidclient/blob/5f26a785/.gitlab-ci.yml>

source: With F-Droid [Update Channels]({{ site.baseurl }}/2017/06/01/announcing-new-libraries-f-droid-update-channels.html), you can even make your app update itself from your nightly repo.
es: Con F-Droid [Canales Actualizados]({{ site.baseurl }}/2017/06/01/announcing-new-libraries-f-droid-update-channels.html), puedes incluso hacer que tu aplicacion se actualize sola de tu repositorio nocturno.

source: "F-Droid and the Janus Vulnerability"
es: "F-Droid y la vulnerabilidad de Janus"

source: The [Janus vulnerability](https://www.guardsquare.com/en/blog/new-android-vulnerability-allows-attackers-modify-apps-without-affecting-their-signatures) has sprung forth unto the Android world, and we have sprung into action to keep it far away.
es: La [Vulnerabilidad de Janus](https://www.guardsquare.com/en/blog/new-android-vulnerability-allows-attackers-modify-apps-without-affecting-their-signatures) ha surgido en el mundo de Android, y nos hemos apresurado a mantenerlo lejos.

source: <p align="center"> <img width="300" height="282" src="{{ site.baseurl }}/assets/posts/2017-12-13-fdroid-and-janus/janus.png" /> </p>
es: <p align="center"> 1 <img width="300" height="282" src="{{ site.baseurl }}/assets/posts/2017-12-13-fdroid-and-janus/janus.png" /> 2 </p> 3

source: First off, _f-droid.org_, _guardianproject.info/fdroid_ and _apt.izzysoft.de/fdroid_ were scanned for possible Janus exploits and none were found. _f-droid.org_'s greatest protection against malware is the requirement that everything must be built from source, humans review all apps that are added, and a source tarball for each build is stored forever. Exploit writers do not want to give away the source code to their malware nor have their activities permanently logged in _git_, so this process keeps them away. No malware has been found in _f-droid.org_ in its 7 years of operation.
es: Primero, _f-droid.org_, _guardianproject.info/fdroid_ and _apt.izzysoft.de/fdroid_ fueron escaneados en busca de posibles aplicaciones afectadas por Janus y no fue encontrada ninguna. La mayor proteccion de _f-droid.org_ en contra de malware es el requisito de que todo tiene que estar construido de fuente, humanos revisan todas las aplicaciones que son agregadas, y una fuente tarball por cada creacion es almacenada para siempre. Los programadores maliciosos no quieren entregar el codigo fuente de su malware y no quieren que sus actividades sean grabadas permanentemente en _git_, asi que este proceso los mantiene alejados. Ningun malware ha sido encontrado en _f-droid.org_ en 7 años de operacion.

source: F-Droid is also an open ecosystem, that means many people are getting apps from other sources. For that reason, we are working to add Janus detection to the F-Droid Android client app. When an APK with a Janus exploit is found, it will prompt the user to uninstall it in the "Updates" tab. If an APK with a Janus exploit is downloaded from a repo that has allowed it in, it will be blocked from being installed.
es: F-Droid es tambien un ecosistema abierto, lo que significa que muchas personas estan obteniendo aplicaciones de otras fuentes. Por esta razon, estamos trabajando para agregar deteccion de Janus a la aplicacion cliente Android F-Droid. Cuando una APK afectada con Janus es encontrada, requirira al usuario installarla en la lista de " Actualizaciones" . Si una APK afectada por anus es descargada de un repositorio que le ha permitido entrar, la instalacion sera bloqueada.

source: There is also some random good news: it turns out that none of the about 10 Janus examples we have can pass `fdroid update`. Most of them failed to verify when `fdroid update` calls `aapt dump badging`. The one file that passed those tests was the publicly released [Janus demo APK](https://www.androidpolice.com/wp-content/uploads/janus-poc/HelloWorld-Janus.apk). But it had strange dates like `2042-14-03 00:62:15` in the ZIP entries, probably because of the tricks needed to assemble this DEX+ZIP file. This triggered a crash in `fdroid update`, when parsing the date of _AndroidManifest.xml_. Python complains that there is no 14th month. This crash prevents the APK from being added to the repo. We have also added an [explicit block](https://gitlab.com/fdroid/fdroidserver/merge_requests/409) for APKs trying to exploit Janus.
es: Tambien hay algunas buenas noticias relacionadas: resulta que ninguna de los 10 ejemplos de Janus que tenemos pueden pasar `fdroid update`. La mayoria de ellos fallaron la verificacion cuando F-droid lla la actualizacion calls `aapt dump badging`. El unico archivo que paso esas pruebas fue el lanzamiento publico [Janus demo APK](https://www.androidpolice.com/wp-content/uploads/janus-poc/HelloWorld-Janus.apk). Pero tenia fechas extrañas como `2042-14-03 00:62:15` en las entradas del ZIP, probablemente por los trucos necesarios para armar el archivo DEX+ZIP. Esto detono un fallo en `fdroid update`, durante el analisis de la fecha de _AndroidManifest.xml_. Python señala que no existe el mes 14. Este error evita que la APK sea instalada en el repositorio. Tambien hemos agregado un [ bloqueo explicito ](https://gitlab.com/fdroid/fdroidserver/merge_requests/409) para APKs intentando explotar Janus.
