Repository: vecnathewhisperd0/fdroid-website
Catalog: po/_posts.*.po
Languages: bo, es, nb_no, zh_hant

source: Also, _apksigner_ is better at verifying APK signatures, and many Janus examples failed. If _apksigner_ is installed, then `fdroid build` uses it. If an APK is signed with a v2 APK Signature, then things like Janus exploits are not possible. So if you are working with APKs that you have not built from source, be sure to install _apksigner_.
es: Tambien, _apksigner_ es mejor verificando firmas de APK, y muchos ejemplos de Janus fallaron. Si _apksigner_ esta instalado, entonces `fdroid build` lo usa. Si una APK esta firmada con una firma APK v2, entonces cosas como explotaciones de Janus no son posibles, Asi que si estas trabajando con APKs que no has construido de la fuente, asegurate de instalar _apksigner_.

source: So we can safely say that it would be difficult to inadvertently put a Janus exploit in an F-Droid repo. And with the new protections in the Android client app, a repo cannot force the user to install one.
es: Asi que podemos asegurar que seria muy dificil poner una aplicacion afectada por Janus inadvertidamente en un repositorio F-Droid. Y con las medidas de seguridad nuevas en la aplicacion cliente de Android, un repositorio no puede obligar a un usuario a instalarlo.

source: "New Collaborations on Exposing Tracking"
es: " Nuevas colaboraciones para exponer Trackeo"

source: Since 2010, the F-Droid community has been working to provide only 100% verified Free Software, and to make apparent all forms of tracking, advertising, and "[anti-features](https://f-droid.org/wiki/page/AntiFeatures)" commonly found in apps. F-Droid provides a complete app ecosystem where users are actively notified of tracking and advertising in the apps, and can make informed choices. We have achieved this through the work of many dedicated volunteers reviewing apps as they are submitted, and marking the things that they find.
es: Desde el 210, la comunidad de F-Droid ha estado trabajando en proveer unicamente Software gratuito verificado 100% , y para hacer obvias todas las formas de trackeo, y [anti-features](https://f-droid.org/wiki/page/AntiFeatures)" encontradas comunmente en aplicaciones. F-Droid provee un ecosistema de aplicaciones completo donde los usuarios son notificados activamente sobre trackeo y anuncios en las aplicaciones, y pueden realizar selecciones basados en informacion. Hemos logrado esto gracias al trabajo de muchos voluntarios dedicados a revisar las aplicaciones en cuanto son enviadas, y marcando las cosas que encuentran.

source: Researchers at [Exodus Privacy](https://exodus-privacy.eu.org) and [Yale Privacy Lab](https://privacylab.yale.edu) are working on taking the next big step, by creating tools for automating the process of finding all the [various forms of tracking](https://theintercept.com/2017/11/24/staggering-variety-of-clandestine-trackers-found-in-popular-android-apps) that apps can include. F-Droid will work with them to merge efforts, increasing the effectiveness of volunteers, and exposing the inner workings of software in daily use worldwide.
es: Investigadores en [Exodus Privacy](https://exodus-privacy.eu.org) y [Yale Privacy Lab](https://privacylab.yale.edu) estan trabajando para tomar el siguiente paso, mediante la creacion de herramientas para la automatizacion de el proceso para detectar todas las [formas de trackeo](https://theintercept.com/2017/11/24/staggering-variety-of-clandestine-trackers-found-in-popular-android-apps) que pueden incluir las aplicaciones. F-Droid trabajara con ellos para combinar esfuerzos, incrementar la efectividad de los voluntarios, y exponer el funcionamiento interno de el Software de uso diario a nivel mundial.

source: F-Droid represents a trustworthy method of getting apps, a _libre_ and _gratis_ alternative to the "app store" model that is driven by advertising revenue and data collection. F-Droid makes custom builds of Free Software like Firefox and Telegram, removing code that limits the freedom of its users. What we most often remove is third-party SDKs (Software Development Kits) that enable tracking while denying the user of the apps a choice.
es: F-Droid representa un metodo de confianza para obtener aplicaciones, una alternativa _libre_ and _gratis_ a el modelo de "tienda de aplicaciones" que es manejado por anuncios, ganancias economicas y coleccion de datos. F-Droid desarrolla Software gratuito personalizado como Firefox y elegram, removiendo el codigo que limita la libertad de sus usuarios. Lo que mas removemos generalmente es SDKs ( Software Development Kits) de terceras personas que habilitan el trackeo mientras niegan al usuario la opcion en la aplicacion.

source: There are pragmatic uses of tracking, such as usability testing, crash reporting, and release management. Even when such information is collected in an "anonymous" or "randomized" fashion, it often represents a unique data profile of a user that may expose private details. This is especially true when information is correlated with the rich data sets of software industry giants.
es: Existen usos pragmáticos del seguimiento , como pruebas de usabilidad, informes de fallos y gestión de versiones. Incluso cuando dicha información se recopila de forma "anónima" o "aleatoria", a menudo representa un perfil de datos único de un usuario que puede exponer detalles privados. Esto es especialmente cierto cuando la información se relaciona con los conjuntos de datos de gigantes de la industria del software.

source: Billions of users around the globe are now running mobile platforms based upon Free Software, such as Android. For many, mobile devices are the primary gateway to the Internet. These devices are often collecting and transmitting intimate details about users such as behavior and location, through complex and hidden methods. The international Free Software community must continue to be a leader, protecting and restoring trust, privacy, and security in mobile computing.
es: Miles de millones de usuarios en todo el mundo ahora están ejecutando plataformas móviles basadas en software libre, como Android. Para muchos, los dispositivos móviles son la puerta de entrada principal a Internet. Estos dispositivos suelen recopilar y transmitir detalles íntimos sobre los usuarios, como el comportamiento y la ubicación, a través de métodos complejos y ocultos. La comunidad internacional de Software Libre debe continuar siendo líder, protegiendo y restaurando la confianza, la privacidad y la seguridad en la informática móvil.

source: "Upcoming Security Audit"
es: "Próxima auditoría de seguridad"

source: We have started the process of the second security audit of the F-Droid setup. The audit will be conducted by [Radically Open Security](https://www.radicallyopensecurity.com), which is a natural partner for F-Droid since they share our focus on free software and open processes. Once we receive the results and have addressed any issues found, we will publish the full, unedited audit report here. Thanks to [Open Tech Fund](https://opentech.fund) for covering the costs of hiring the auditor.
es: Hemos comenzado el proceso de la segunda auditoría de seguridad de la configuración de F-Droid. La auditoría se llevará a cabo por [Radically Open Security](https://www.radicallyopensecurity.com), que es un socio natural de F-Droid, ya que comparten nuestro enfoque en el software libre y los procesos abiertos. Una vez que recibamos los resultados y abordemos cualquier problema encontrado, publicaremos aquí el informe de auditoría completo sin editar. Gracias a [Open Tech Fund](https://opentech.fund) por cubrir los costos de contratación del auditor.

source: For more information about F-Droid's security practices on in the documentation about the [Security Model]({{ site.baseurl }}/docs/Security_Model/).
es: Para obtener más información sobre las prácticas de seguridad de F-Droid, consulte la documentación sobre [Modelo de seguridad]({{ site.baseurl }}/docs/Security_Model/).

source: Looking back at the first security audit
es: Mirando hacia atrás a la primera auditoría de seguridad

source: We received an [external audit](https://cure53.de/pentest-report_fdroid.pdf) in 2015 from Cure53, provided by the [Open Tech Fund](https://opentech.fund). This was the first full security audit of the core security practices of F-Droid. On top of the core, the focus on the audit was on the new, experimental features that opened up F-Droid as an ecosystem, moving away from the central server model.
es: Recibimos una [auditoría externa](https://cure53.de/pentest-report_fdroid.pdf) en 2015 de Cure53, proporcionada por [Open Tech Fund](https://opentech.fund). Esta fue la primera auditoría de seguridad completa de las prácticas de seguridad básicas de F-Droid. Además del núcleo, el enfoque en la auditoría fue en las nuevas características experimentales que abrieron a F-Droid como un ecosistema, alejándose del modelo de servidor central.

source: This audit confirmed the security of core pieces, as listed on the top of this page. That is a little hard to see since the report only discussed the vulnerabilities that were discovered. This audit did find critical issues in the website, opt-in beta features, and some minor features like `fdroid import`, which is only used by a couple of people and never on core infrastructure. It is important to note that the website issues never meant that getting apps via the Android client app was affected. Most importantly, all of the security issues were fixed. The audit also demonstrated that building a system with user-generated inputs is hard to fully secure. Our focus is removing anything that opens up attack vectors to the external data sources like app source repos.
es: Esta auditoría confirmó la seguridad de las piezas del núcleo, como se enumeran en la parte superior de esta página. Eso es un poco difícil de ver ya que el informe solo discutió las vulnerabilidades que se descubrieron. Esta auditoría sí encontró problemas críticos en el sitio web, características opcionales de beta y algunas características menores como `fdroid import`, que solo es usado por un par de personas y nunca en la infraestructura central. Es importante tener en cuenta que los problemas del sitio web nunca significaron que la aplicación de Android se viera afectada. Lo más importante, todos los problemas de seguridad fueron corregidos. La auditoría también demostró que construir un sistema con entradas generadas por los usuarios es difícil de asegurar por completo. Nuestro objetivo es eliminar todo lo que abre vectores de ataque a las fuentes de datos externas, como repositorios fuente de la aplicación.

source: The normal way of using F-Droid was not affected. For example, regarding _BZ-01-004 Command Injection Flaw_, the root-based installation method was marked experimental, not widely used, and removed around not long after the report came out. The _BZ-01-002_ and _BZ-01-003_ TOFU issues never applied to the default app repos since the repo keys are built into the client app.
es: La forma normal de usar F-Droid no se vio afectada. Por ejemplo, con respecto a _BZ-01-004 Command Injection Flaw_, el método de instalación basado en la raíz se marcó experimental, no se usó ampliamente, y se eliminó no mucho después de que salió el informe. Los problemas de _BZ-01-002_ y _BZ-01-003_ TOFU nunca se aplicaron a los repos de aplicaciones predeterminadas ya que las claves de repos están integradas en la aplicación de cliente.

source: The serious issues that affected the ecosystem where:
es: Los problemas serios que afectaron al ecosistema fueron:

source: BZ-01-005 App with WES Permission can replace APKs before Installation (_fixed_)
es: La aplicación BZ-01-005 con WES Permiso puede reemplazar los APK antes de la instalación (_fixed_)

source: BZ-01-008 Multiple XSS Problems in WP-FDroid Plugin (_we entirely removed Wordpress, the site is now statically generated using Jekyll_)
es: BZ-01-008 Múltiples problemas XSS en el plugin WP-FDroid (_ eliminamos completamente Wordpress, el sitio ahora está generado estáticamente usando Jekyll_)

source: BZ-01-011 Persistent XSS via SVG Upload in MediaWiki (_bug fixed in MediaWiki, SVG upload disabled, and open wiki registrations disabled on f-droid.org_)
es: BZ-01-011 XSS persistente a través de SVG Cargar en MediaWiki (_bug corregido en MediaWiki, carga de SVG deshabilitada y abrir registros de wiki deshabilitados en f-droid.org_)

source: BZ-01-014 RCE via fdroid checkupdates Command on Git Repository (_fixed_)
es: BZ-01-014 RCE a través del Comando fdroid checkupdates en el repositorio Git (_fixed_)

source: These only affected a few non-critical users or were parts of opt-in beta features:
es: Estos solo afectaron a algunos usuarios no críticos o formaban parte de las características beta optativas:

source: BZ-01-002 TOFU Requests too easy to recognize and intercept (_fixed_)
es: La solicitud BZ-01-002 TOFU es demasiado fácil de reconocer e interceptar (_fixed_)

source: BZ-01-003 Repository Fingerprint is not verified on first Fetch (_fixed_)
es: El Fingerprint de el repositorio BZ-01-003 no se verifica en la primera extracción (_fixed_)

source: BZ-01-004 Command Injection Flaw in root - based Installation Method (_only repo publisher could do this, removed root-based installation method_)
es: BZ-01-004 Error de inyección de comando en el método de instalación basado en la raíz (_ solo el editor del repositorio podia hacer esto, eliminamos el método de instalación basado en la raíz_)

source: BZ-01-012 Arbitrary Command Execution via `fdroid import` and SVN
es: BZ-01-012 Ejecución de comandos arbitrarios a través de `fdroid import` y SVN

source: The following issues all assume developer- or publisher-level access. We do not claim to protect against attackers with that level of access. People in those roles can always publish malicious code directly, without resorting to complicated exploits.
es: Todos los siguientes problemas asumen el acceso de nivel desarrollador o editor. No pretendemos proteger contra los atacantes con ese nivel de acceso. Las personas en esos roles siempre pueden publicar código malicioso directamente, sin recurrir a exploits complicados.

source: BZ-01-007 Malicious symlinked APK can lead to arbitrary File Read
es: BZ-01-007 APK enlazado maliciosamente puede conducir a la lectura de archivos arbitraria

source: BZ-01-013 Directory Traversal Exploit Potential caused by `fdroid import`
es: BZ-01-013 Posibilidad de explotación de directorio causado por `importación de fdroid`

source: BZ-01-015 SVN Repository Access leaks Credentials to local Processes
es: BZ-01-015 SVN Repository Access filtra credenciales a procesos locales

source: BZ-01-017 Unauthorized Access to internal Network Resources
es: BZ-01-017 Acceso no autorizado a recursos internos de la red

source: The audit report PDF from Cure53 is also cached on this site: [pentest-report_fdroid.pdf]({{ site.baseurl }}/assets/posts/2018-01-20-upcoming-security-audit/pentest-report_fdroid.pdf).
es: El PDF del informe de auditoría de Cure53 también se almacena en caché en este sitio: [pentest-report_fdroid.pdf]({{ site.baseurl }}/assets/posts/2018-01-20-upcoming-security-audit/pentest-report_fdroid.pdf).

source: "Fairphone Open ships F-Droid Privileged Extension!"
es: "¡Fairphone Open envía F-Droid Privileged Extension!"

source: Fairphone has taken a [big step](https://www.fairphone.com/en/2018/01/23/f-droid-auto-updates/) towards making a fully free Android phone! They already have [Fairphone Open](https://www.fairphone.com/en/2016/04/28/releasing-the-fairphone-2-open-operating-system-2/), an alternate version of Android that does not include any proprietary apps. The built-in Fairphone Updater makes it really easy to switch a Fairphone away from the Google Android version to Fairphone Open. And now, Fairphone Open includes F-Droid! That means it is a fully functional device, removing the requirement to flash extra packages to get an app store. It also means that F-Droid works without enabling "Unknown Sources". Then your Fairphone Open can automatically update apps and it'll have a smoother install experience where you just need to press install once, and the whole process will finish in the background (when you are ready for background updates, go to F-Droid's Settings to enable them).
es: Fairphone ha tomado un [gran paso](https://www.fairphone.com/en/2018/01/23/f-droid-auto-updates/) para crear un teléfono Android totalmente gratuito. Ya tienen [Fairphone Open](https://www.fairphone.com/en/2016/04/28/releasing-the-fairphone-2-open-operating-system-2/), una versión alternativa de Android que no incluye ninguna aplicación propietaria. El Fairphone Updater incorporado hace que sea muy fácil cambiar un Fairphone de la versión de Google Android a Fairphone Open. ¡Y ahora, Fairphone Open incluye F-Droid! Eso significa que es un dispositivo completamente funcional, eliminando el requisito de flashear paquetes adicionales para obtener una tienda de aplicaciones. También significa que F-Droid funciona sin habilitar "Fuentes Desconocidas". Luego, su Fairphone Open puede actualizar automáticamente las aplicaciones y tendrá una experiencia de instalación más suave donde solo tendrá que presionar instalar una vez, y todo el proceso finalizará en segundo plano (cuando esté listo para las actualizaciones de fondo, vaya a la configuración de F-Droid para habilitarlos).

source: F-Droid support in Fairphone Open is still beta, so for now, only [Privileged Extension](https://gitlab.com/fdroid/privileged-extension/#f-droid-privileged-extension) is built into Fairphone Open. So you will still have to download F-Droid and install it as a regular app. It will automatically find and use the Privileged Extension built into Fairphone Open. We are working on an F-Droid installer as part of the Fairphone Updater to make that process really easy.
es: El soporte de F-Droid en Fairphone Open sigue siendo beta, por lo que por ahora, solo [Privileged Extension](https://gitlab.com/fdroid/privileged-extension/#f-droid-privileged-extension) está integrado en Fairphone Open. Por lo tanto, tendrá que descargar F-Droid e instalarlo como una aplicación normal. Automáticamente encontrará y usará la Privileged Extension integrada en Fairphone Open. Estamos trabajando en un instalador de F-Droid como parte de Fairphone Updater para hacer que el proceso sea realmente fácil.

source: For now, these are the steps you need to do to have the full F-Droid experience with Fairphone Open:
es: Por ahora, estos son los pasos que debes seguir para tener la experiencia completa de F-Droid con Fairphone Open:

source: download [F-Droid.apk](/F-Droid.apk) and [verify](/F-Droid.apk.asc) it
es: descarga [F-Droid.apk](/F-Droid.apk) y [verificalo](/F-Droid.apk.asc)

source: enable "Unknown Sources" in Settings -> Security
es: habilita "Fuentes desconocidas" en Configuración -> Seguridad

source: find _FDroid.apk_ in Downloads and click to install it
es: encuentre _FDroid.apk_ en Descargas y haga clic para instalarlo

source: confirm the install on the system's install screen
es: confirmar la instalación en la pantalla de instalación del sistema

source: disable "Unknown Sources"
es: deshabilitar "Fuentes Desconocidas

source: "F-Droid presentation at the Linux.conf.au 2018 conference"
es: "Presentación de F-Droid en la conferencia Linux.conf.au 2018"

source: In Sydney, New South Wales on Monday 22 January through to Friday 26 January, Linux.conf.au, the Australian Linux conference took place.
es: En Sydney, Nueva Gales del Sur, desde el lunes 22 de enero hasta el viernes 26 de enero, Linux.conf.au, tuvo lugar la conferencia australiana Linux.

source: F-Droid's [Peter Serwylo](https://gitlab.com/pserwylo) was there Thursday, 25 Jan, presenting his _"F-Droid: The private, secure, free and open app store for Android"_.
es: F-Droid [Peter Serwylo](https://gitlab.com/pserwylo) estuvo allí el jueves 25 de enero, presentando su _ "F-Droid: la tienda de aplicaciones privada, segura, gratuita y abierta para Android" _.

source: The 45 minutes long talk covers how F-Droid come to be, focussing on the client, its security model, and how it is being used to ensure everyone (look out for the "[collateral freedom](https://en.wikipedia.org/wiki/Collateral_freedom)" bit) is able to access high quality open source apps, using tools developed to make it easier for anybody to setup and run their own curated app store.
es: La charla de 45 minutos cubre cómo F-Droid se convierte en realidad, centrándose en el cliente, su modelo de seguridad y cómo se usa para garantizar que todos (busquen la "Libertad colateral" (https: //en.wikipedia .org/wiki/Collateral_freedom) "bit) es capaz de acceder a aplicaciones de código abierto de alta calidad, utilizando herramientas desarrolladas para que sea más fácil para cualquiera configurar y ejecutar su propia tienda de aplicaciones seleccionada.

source: This is a great primer for new users giving them a behind the scenes view on how apps come to be, from a source code repo to their Android devices.
es: Este es un excelente manual para nuevos usuarios que les brinda una visión de detrás de escena sobre cómo se crean las aplicaciones, desde un repositorio de código fuente hasta sus dispositivos Android.

source: <a class="youtube" href="https://youtube.com/watch?v=y3zVcYuE-WI"> <img src="{{ site.baseurl }}/assets/posts/2018-02-02-linux-conf-au-fdroid-presentation/video-thumbnail.png" /> </a>
es: <a class="youtube" href="https://youtube.com/watch?v=y3zVcYuE-WI"> 1 <img src="{{ site.baseurl }}/assets/posts/2018-02-02-linux-conf-au-fdroid-presentation/video-thumbnail.png" /> 2 </a> 3

source: "Website Updates"
es: " Actualizaciones del Sitio Web"

source: There have been a couple of important updates to this website. First, a longstanding complaint about this website is that there is only prominent donation buttons for F-Droid itself, and not for the apps. We want to support as many app developers as possible, so the app pages have been updated to highlight that app's donation options. See [Mastalab]({{ site.baseurl }}/packages/fr.gouv.etalab.mastodon/), [Telegram]({{ site.baseurl }}/packages/org.telegram.messenger/), or [F-Droid itself]({{ site.baseurl }}/packages/org.fdroid.fdroid/) to see what the new layout looks like.
es: Hemos hecho un par de actualizaciones importantes en este sitio web. En primer lugar, una quejaque tuvimos por mucho tiempo sobre este sitio web es que solo hay botones de donación prominentes para F-Droid, y no para las aplicaciones. Queremos apoyar a tantos desarrolladores de aplicaciones como sea posible, por lo que las páginas de la aplicación se han actualizado para resaltar las opciones de donación de la aplicación. Ver [Mastalab]({{ site.baseurl }}/packages/fr.gouv.etalab.mastodon/), [Telegram]({{ site.baseurl }}/packages/org.telegram.messenger/), o [F-Droid]({{ site.baseurl }}/packages/org.fdroid.fdroid/) para ver cómo se ve el nuevo diseño.
