Repository: vecnathewhisperd0/fdroid-website
Catalog: po/_posts.*.po
Languages: bo, es, nb_no, zh_hant

source: "A new UX 6 years in the making"
bo: "UX གསར་པ་འདི་ལོ་དྲུག་གི་རིང་ལ་བཟོས་བཞིན་ཡོད།"
es: «Una renovada interfaz fraguándose durante seis años»
nb_no: "Et nytt brukergrensesnitt, 6 år på dreiebenken"
zh_hant: "6年光陰打造新的用戶體驗界面"

source: F-Droid has been a part of the Android ecosystem for over 6 years now. Since then, over 2000 apps have been built for the main repository, many [great features have been added](https://gitlab.com/fdroid/fdroidclient/blob/master/CHANGELOG.md), the client has been translated into over 40 different languages, and much more.
bo: ཨེཕ་རོཌ་དེ་བཞིན་ཨེན་ཀྲོཌ་དཀྱིལ་འཁོར་ནང་གི་ཆ་ཤས་སུ་གནས་ནས་ལོ་ ༦ ལྷག་ཙམ་འགྲོ་གི་ཡོད། དུས་དེ་ནས་མཛོད་ཁང་ཨ་མའི་ནང་ལ་མཉེན་ཆས་ ༢༠༠༠ ལྷག་བཟོས་ཐུབ་པ་བྱུང་ཡོད། [ངོ་མཚར་ཅན་གྱི་ཁྱད་ཆོས་དུ་མ་ཞིག་ཁ་སྣོན་བྱས་ཡོད།] (https://gitlab.com/fdroid/fdroidclient/blob/master/CHANGELOG.md) མཉེས་ཆས་དེ་བཞིན་སྐད་རིགས་ཁག་མི་འདྲ་བ་ ༤༠ ལྷག་ནང་བསྒྱུར་ཡོད།
es: F-Droid entró a formar parte del ecosistema Android hace más de seis años. Desde entonces, se han integrado más de 2000 aplicaciones en el repositorio principal, se han añadido [muchas funcionalidades importantes](https://gitlab.com/fdroid/fdroidclient/blob/master/CHANGELOG.md), se ha traducido el cliente a más de 40 diferentes lenguas y muchas cosas más.
nb_no: F-Droid har vært en del av Android-økosystemet i 6 år nå. Siden da, har 2000 programmer blitt bygd for hovedpakkebrønnen, mange [flotte funksjoner har kommet til](https://gitlab.com/fdroid/fdroidclient/blob/master/CHANGELOG.md), klienten har blitt oversatt til over 40 språk, og mye mer.
zh_hant: F-Droid 作為 Android 生態系中的一份子已超過6年了。如今，主要的資源庫裏已有超過 2000 應用程式, 許多[重要功能被放入](https://gitlab.com/fdroid/fdroidclient/blob/master/CHANGELOG.md), 客戶端應用有 40 種以上的不同語言翻譯版本等等。

source: However, the F-Droid UX has never changed much from [the original three tab layout](https://f-droid.org/posts/f-droid-repository-alpha/):
bo: ཡིན་ནའང་། ཨེཕ་རོཌ་UX [ཐོག་མིའི་དྲྭ་ཤོག་གསུམ་སྟོན་པའི་]ཆ་ལ་འགྱུར་བ་དེ་ཙམ་ཕྱིན་མེད། (https://f-droid.org/posts/f-droid-repository-alpha/):
es: Sin embargo, la interfaz de F-Droid nunca se desvió demasiado de la [distribución original en tres pestañas](https://f-droid.org/posts/f-droid-repository-alpha/):
nb_no: Dog har ikke selve brukergrensesnittet i F-Droid endret seg mye fra [det opprinnelige fanebaserte oppsettet](https://f-droid.org/posts/f-droid-repository-alpha/):
zh_hant: F-Droid 用戶體驗界面未曾改變太多[原來的三個分頁版型](https://f-droid.org/posts/f-droid-repository-alpha/)：

source: {: .gallery} * ![Version 0.11]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/0.11.png) * ![Version 0.102]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/0.102.png)
bo: {: .པར་རིས་ཁང་} * ![ཐོན་རིམ་ 0.11]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/0.11.png) * ![ཐོན་རིམ་0.102]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/0.102.png)
es: {: .gallery} * ![Versión 0.11]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/0.11.png) * ![Versión 0.102]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/0.102.png)

source: This will change with the coming release of F-Droid client v0.103.
bo: འགྱུར་བ་འདི་ཨེཕ་རོཌ་མཉེན་ཆས་v0.103 འགྲེལ་སྤེལ་བྱས་པ་ནས་ཐོན་ཐུབ།
es: Esto cambiará con la próxima versión del cliente de F-Droid, la 0.103.
nb_no: Dette vil endre seg med kommende utgave av F-Droid-klienten v0.103.
zh_hant: 在即將發佈的 F-Droid client v0.103版客戶端應用，將有不同。

source: Over the past 6 months, the F-Droid team has been busy redesigning a modern UX which will help bring F-Droid into the present. Some of the big ticket items include:
bo: ཟླ་བ ༦ ཙམ་གྱི་རིང་ལ་ཨེཕ་རོཌ་རུ་ཁག་རྣམས་འབྲེལ་ཚུབ་ཀྱི་ངང་ནས་དེང་དུས་ཀྱི་UX སྐྱར་དུ་བཟོ་བཀོད་བྱས་ཏེ་ད་ལྟའི་ཨེཕ་རོཌ་གསར་པ་དེ་སྟོན་ཐུབ་པ་ལ་ཕན་ཐོགས་བྱས་ཡོད། འདིའི་ནང་དུ་ཡོད་པའི་རྣམ་གྲངས་ཆེ་ཁག་ནི།:
es: Durante los seis meses pasados, el equipo de F-Droid ha estado ocupado rediseñando una interfaz moderna que ayude a traer F-Droid al presente. Algunas de las mejoras más esperadas son:
zh_hant: 過去六個月來，F-Droid 團隊忙於重新設計現代版的用戶使用體驗，一些重大的變化：

source: Screenshots and feature graphics
bo: དྲྭ་ཤེལ་པར་ལེན་དང་བརྐོས་རིས་ཀྱི་ཁྱད་ཆོས་རྣམས།
es: Capturas de pantalla y gráficos destacados
nb_no: Skjermavbildninger og funksjonsgrafikk
zh_hant: 螢幕截圖和功能圖像

source: Bulk download and install
bo: མང་པོ་ཕབ་ལེན་དང་འགྲིག་བཅུག
es: Descarga e instalación en bloque
zh_hant: 批次下載和安裝

source: Offline "queue for download"
bo: དྲྭ་ཐོག་ཏུ་མེད་པ། "རིམ་པ་བཞིན་དུ་ཕབ་ལེན།"
es: «Cola de descargas» sin conexión
zh_hant: 離線"下載排序"

source: Ability to translate apps metadata
bo: མཉེས་ཆས་ཀྱི་རྒྱབ་ལྗོངས་ལོ་རྒྱུས་བསྒྱུར་ཐུབ་པའི་ནུས་པ།
es: Posibilidad de traducir metadatos de aplicaciones
nb_no: Muligheten til å oversette programmers metadata
zh_hant: 能夠翻譯應用的元數據

source: Improved notifications for downloads and pending updates
bo: ཕབ་ལེན་དང་གསར་བསྒྱུར་འགག་བཞིན་པ་རྣམས་ཀྱི་བརྡ་ལན་སྤྲོད་ཐབས་ཡར་རྒྱས་བཏང་ཡོད།
es: Mejoras en las notificaciones de descargas y actualizaciones pendientes
nb_no: Forbedret merknadsstøtte for nedlastinger og ventende oppdateringer
zh_hant: 改善下載和待處理更新的通知

source: {: .gallery} * !["Latest" screen]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/latest.png) * !["Categories" screen]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/categories.png) * !["Nearby" screen]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/nearby.png) * !["Updates" screen]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/updates.png) * ![App details screen (with screenshots)]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/appdetails-a.png) * ![App details screen (without screenshots)]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/appdetails-b.png)
bo: {: .པར་རིས་ཁང} * !["གསར་ཤོས" དྲྭ་ཤེལ་]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/latest.png) * !["སྡེ་ཚན་ཁག་" དྲྭ་ཤེལ་]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/categories.png) * !["ཉེ་འགྲམ་" དྲྭ་ཤེལ་]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/nearby.png) * !["གསར་བསྒྱུར་" དྲྭ་ཤེལ་]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/updates.png) * ![མཉེས་ཆས་ཞིབ་ཚགས་སྐོར་གྱི་དྲྭ་ཤེལ་ (དྲྭ་ཤེལ་པར་ལེན་དང་མཉམ་དུ)]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/appdetails-a.png) * ![མཉེས་ཆས་ཞིབ་ཚགས་སྐོར་གྱི་དྲྭ་ཤེལ་ (དྲྭ་ཤེལ་པར་ལེན་མེད་པ་)]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/appdetails-b.png)
es: {: .gallery} * ![Pantalla de «novedades»]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/latest.png) * ![Pantalla de «categorías»]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/categories.png) * ![Pantalla de «cercanía»]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/nearby.png) * ![Pantalla de «actualizaciones»]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/updates.png) * ![Pantalla de detalles de una aplicación (con capturas de pantalla)]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/appdetails-a.png) * ![Pantalla de detalles de una aplicación (sin capturas de pantalla)]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/appdetails-b.png)
zh_hant: {: .gallery} * !["最新"" 畫面]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/latest.png) * !["類別" 畫面]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/categories.png) * !["附近" 畫面]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/nearby.png) * !["昇級" 畫面]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/updates.png) * ![應用程式詳情畫面 (帶截圖)]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/appdetails-a.png) * ![應用程式詳情畫面 (無截圖)]({{ site.baseurl }}/assets/posts/2017-04-04-new-ux/appdetails-b.png)

source: In addition, we have been redesigning some of the smaller, but equally as important parts of the app, such as better support for visually impaired users who make use of tools such as Talkback, and better support for donating to open source app developers.
bo: འདི་དང་མཉམ་དུ་ང་ཚོས་མཉེས་ཆས་ནང་གི་མ་ལག་ཆུང་བ་རྣམས་ལ་སྐྱར་དུ་བཟོ་བཀོད་བྱེད་ཀྱི་ཡོད། འདི་ཡང་གནད་དོན་གཞན་དང་གཅིག་མཚུངས་ཀྱི་གལ་གནད་ཆེན་པོ་ཞིག་ལ་ངོས་འཛིན་བྱེད་ཀྱི་ཡོད། དཔེར་ན་མིག་ལོང་བ་ཚོས་སྒྲ་ཐོག་ཉན་ཆས་བེད་སྤྱོད་ཐུབ་པར་རྒྱབ་སྐྱོར་བྱེད་ཀྱི་ཡོད། དེས་མ་ཟད་ཕྱི་གསལ་ནང་གསལ་གྱི་ཨང་རྟགས་མཉེན་ཆས་བཟོ་མཁན་ཚོར་ཞལ་འདེབས་གང་མང་ཐོབ་པའི་ཆེད་དུ་རྒྱབ་སྐྱོར་བྱེད་ཀྱི་ཡོད།
es: Además, hemos tenido en cuenta en el rediseño algunos de los detalles menores pero igualmente importantes de la aplicación, que han resultado en una mejora del soporte de las herramientas que usuarios con problemas de visión usan, como Talkback, y también un mejor soporte para donar a los desarrolladores de aplicaciones de código abierto.
nb_no: I tillegg har vi redesignet noen av de mindre, men minst like viktige delene av programmet, som bedre støtte for synshemmede brukere, som bruker verktøy som TalkBack, og bedre støtte for å donere til friprog-utviklere.
zh_hant: 此外我們也重新設計了應用程式當中某些微小但同樣重要的部件，例如更佳地支援視力障礙者可以利用 Talkback 工具，對開源應用程式開發人員的捐助。

source: This has involved extensive design input from UX designers and the community. In addition to the user tests that were conducted early on in the design process, further field tests are currently being conducted to ensure that usability issues with the new design are identified and resolved.
bo: བཟོ་བཀོད་དེའི་ནང་ལ་UX བཟོ་བཀོད་མཁན་དང་ཚོགས་སྡེ་རྣམས་ཀྱིས་མཐུན་རྐྱེན་ཤུགས་ཆེན་སྦྱར་ཡོད། བཟོ་བཀོད་ཀྱི་རྒྱུད་རིམ་གྱི་ནང་ལ་སྤྱོད་མཁན་ཚོར་བཟོ་བཀོད་དེའི་ཚོད་ལྟ་བྱས་ཡོད་པ་མ་ཟས་ད་ལྟའི་ཆར་དངོས་སུ་མང་ཚོགས་ཀྱི་ཁྲོད་ལ་ཚོད་ལྟ་བྱེད་བཞིན་ཡོད་ལ་དེ་ལ་བརྟེན་ནས་ཕྲད་བཞིན་པའི་དཀའ་ངལ་རྣམས་ངོས་འཛིན་ཐུབ་པ་བྱུང་ནས་སེལ་ཐུབ་པ་བྱུང་ཡོད།
es: En esta tarea han participado diseñadores de interfaces y la comunidad de usuarios. Además de las pruebas de usuario que se llevaron a cabo en una fase temprana del diseño, se están haciendo más estudios de campo actualmente para asegurar que las deficiencias en usabilidad del nuevo diseño se identifican y resuelven.
nb_no: Dette har omfattet en utvidet samtale med våre grensesnittsdesignere og gemenskapen. I tillegg til brukertester som ble utført tidlig i prosessen, videre felttester foretas og blir overveid for å forsikre at bruksproblemer med det nye designet blir identifisert og løst.
zh_hant: 這涉及使用者體驗設計者與社區的大量投入，而在早期階段進行使用者測試、進一步的田野測試目前正在進行中，以確保新設計的可用度問題可以及早地發現和解決。

source: Over the coming weeks you will see alpha releases for v0.103. We encourage your feedback and suggestions about how to continually improve the F-Droid client.
bo: ཡོང་འགྱུར་གྱི་བདུན་ཕྲག་འདིའི་ནང་ལ་ v0.103 ཐོན་དང་པོ་དེ་ཁྱེད་རྣམས་ཀྱི་སྤྱན་ལམ་ལ་འགྲེམ་སྤེལ་ཞུ་གི་ཡོད། ཁྱེད་རྣམས་ཀྱིས་ཨེཕ་རོཌ་མཉེན་ཆས་དེ་གོང་འཕེལ་གཏོང་ཐབས་སུ་དགོངས་འཆར་གང་མང་གནང་བའི་རེ་སྐུལ་ཞུ་གི་ཡོད།
es: Durante las próximas semanas verás nuevas versiones alfa de la versión 0.103. Te animamos a comentar y sugerir posibles y futuras mejoras para el cliente de F-Droid.
nb_no: I løpet av de kommende ukene vil du se alfa-utgaver som leder opp til v0.103. Vi kommer dine tilbakemeldinger varmt i møte, og håper på forslag om hvordan F-Droid-klienten kontinuerlig kan forbedres.
zh_hant: 未來幾週 v0.103測試版即將發佈，歡迎用戶的回饋與建議，好讓我們持續來改善 F-Droid 客戶端應用。

source: This is one of the many improvements happening to the broader F-Droid ecosystem in 2017, so keep an eye out for more!
bo: ཨེཕ་རོཌ་དཀྱིལ་འཁོར་རྒྱ་ཆེ་ས་ནས་ཡར་རྒྱས་གོང་སྤེལ་གཏོང་བའི་ཐབས་ལམ་དེ་ཕྱི་ལོ་ ༢༠༡༧ ནང་ལ་བྱུང་བ་ཞིག་ཡིན། འབྱུང་འགྱུར་དེ་ལས་མང་པ་དོ་སྣང་གནང་རོགས།!
es: Esta es una de las muchas mejoras en el amplio ecosistema de F-Droid que verás en 2017. Mantente al tanto, ¡hay más por venir!
nb_no: Dette er én av mange forbedringer som har hendt i det videre F-Droid-økosystemet i 2017, så hold et øye med ting for mer!
zh_hant: 這是2017年 F-Droid 生態系重要的改善之一, 請繼續關注！

source: "Announcing new libraries: F-Droid Update Channels"
es: " Anunciando nuevas librerias: Canales de actualizacion F-Droid "

source: In order to complete the F-Droid distribution ecosystem, we are introducing [__F-Droid Update Channels__](https://gitlab.com/fdroid/update-channels). It is a suite of libraries for apps to find updates, no matter from where it was originally downloaded. In many parts of the world, it is very common to get Android APKs outside of the app stores where the developers upload them.
es: Para poder completar el ecosistema de distribucion de F-Droid, introducimos [__Canales de Actualizacion F-Droid__ ](https://gitlab.com/fdroid/update-channels). " Un conjunto de librerias para encontrar actualizaciones para aplicaciones , sin importar de donde fueron descargadas originalmente." En muchas partes del mundo, es muy comun obtener APKs para Android fuera de las tiendas de aplicaciones donde los desarolladores las suben.

source: third party app stores scrape other app stores for APKs
es: Tiendas de aplicaciones independientes extraen APKs de otras tiendas de aplicaciones

source: APKs are bluetoothed, directly, downloaded, etc
es: Los APKs son compartidos via Bluetooth, directamente, descargados, etc

source: users share APKs via services like Aptoide
es: los usuarios comparten APKs usando servicios como Aptoide

source: In order to ensure that your app always can find updates, we are introducing two specific libraries:
es: Para asegurarnos que tus aplicaciones siempre encuentren actualizaciones, introducimos dos librerias especificas:

source: "Get F-Droid" aka [org.fdroid.getfdroid](https://gitlab.com/fdroid/update-channels/tree/master/getfdroid#f-droid-installer)
es: " Obten F-Droid " tambien conocido como [org.fdroid.getfdroid](https://gitlab.com/fdroid/update-channels/tree/master/getfdroid#f-droid-installer)

source: Checks whether F-Droid is installed. If not, it will help the user to download and install F-Droid in a secure way. F-Droid then provides the update channel for all apps available in F-Droid.
es: Comprueba que F-Droid este instalado. Si no lo esta ayuda al usuario a descargar e instalar F-Droid en una forma segura. Y despues F-Droid proporciona el canal de actualizacion para todas las aplicaciones disponible en F-Droid.

source: "App Updater" aka [org.fdroid.appupdater](https://gitlab.com/fdroid/update-channels/tree/master/appupdater#f-droid-update-detector)
es: " Actualizador de Aplicaciones " o [org.fdroid.appupdater](https://gitlab.com/fdroid/update-channels/tree/master/appupdater#f-droid-update-detector)

source: Keeps the app current by checking the hard-coded app repository set up by the developer. This is similar to the popular "App Updater" library, but handles everything securely using F-Droid signed metadata. The _fdroidserver_ tools handle the creation and maintenance of the app repository.
es: Mantiene la aplicacion actualizada checando el repositoriode ficheros de codigo rigido establecido por el desarrollador. Esto es semejante la libreria popular " Actualizador de Aplicaciones " , pero maneja todo de manera segura usando metadatos firmados por F-Droid. La herramienta _fdroidserver_ maneja la creacion y mantenimiento del repositorio de ficheros de la aplicacion.

source: Compatible with Google Play Terms of Service
es: Compatible con los terminos de servicio de Google Play

source: Both of these libraries also check whether Google Play is installed, if so, will disable itself. This allows apps to include this library in APKs that are uploaded to Google Play since it will not violate the Google Play Terms of Service.
es: Ambas librerias tambien verifican si Google Play esta instalado, y si lo esta, se deshabilitara el mismo. Esto permite a las aplicaciones incluir esta libreria en los APKs que son subidos a Google Play ya que no violan los Terminos de Servicio de Google Play.

source: "How F-Droid is Bringing Apps to Cuba"
es: " Como F-Droid esta llevando aplicaciones a Cuba "

source: Only in 2015, when the government opened the first public WiFi hotspots in the country, did internet access become available to ordinary Cubans. Before that, even though modern mobile phones had already found their way into the country, they were mostly used off-line. Now, all these phones can be connected to the internet. However, at 1.50 CUC per hour, this is still not affordable to most Cubans whose average salary is only 20 CUC per month.
es: Unicamente en el 2015, cuando el govierno abrio el primer punto de acceso WiFi en el pais, el acceso a internet se volvio disponible para los Cubanos ordinarios. Antes de eso, incluso cuando los telefonos modernos llegaron al pais, eran utilizados unicamente sin acceso a Internet. Ahora todos estos telefonos se pueden conectar al internet. Sinembargo, a 1.50 CUC por hora, sigue siendo inaccesible para la mayoria de los Cubanos que ganan un salario mensuel de 20 CUC.

source: ![]({{ site.baseurl }}/assets/posts/2017-07-03-cuba/celulares_apps_and_updates.jpg)<br/> *Mobile Phone Shop offering Apps and Updates*
es: ![]({{ site.baseurl }}/assets/posts/2017-07-03-cuba/celulares_apps_and_updates.jpg)<br/> 1 * Tienda de telefonos mobiles ofreciendo aplicaciones y actualizaciones*

source: So it is not surprising that most Cubans do not use what little expensive bandwidth they have available to download apps, but use it for other things such as communicating with their relatives. If they want apps, they can go to one of the many mobile phone repair shops and get them installed there for a nominal fee.
es: Por lo tanto no es ninguna sorpresa que los Cubanos no utilizen el ancho de banda limitado al que tienen acceso para descargar aplicaciones, lo utilizan en otras actividades como comunicarse con sus familiares. Si quieren aplicaciones pueden ir a las tiendas de reparacion de telefonos mobiles e instalarlas ahi por una cantidad minima.

source: In order to distinguish themselves from the tough competition, some shops take an interesting approach: They <a href="https://guardianproject.info/2017/02/22/build-your-own-app-store-android-media-distribution-for-everyone/">open up their own app store</a> in a local (offline) WiFi network to attract customers.
es: Algunas tiendas han tomado un enfoque interesante para distiguirse de la competencia: Abren <a href="https://guardianproject.info/2017/02/22/build-your-own-app-store-android-media-distribution-for-everyone/"> 1 su propia tienda de aplicaciones </a> 2 en una red WiFi local ( sin acceso a internet) para atraer clientes.

source: The only existing technology that allows everybody to open their own app store is called <a href="https://f-droid.org/">F-Droid</a>. It is a full-blown app store kit that comes with all the tools and <a href="https://f-droid.org/docs/">documentation</a> required to open up your own store: an <a href="https://gitlab.com/fdroid/fdroidserver/">app store server</a>, the <a href="https://gitlab.com/fdroid/fdroidclient">app</a> to install the apps with on your phone and a <a href="https://gitlab.com/fdroid/repomaker">curation tool</a> to manage your store with ease.
es: LA unica tecnologia existente que les permite a todos abrir su propia tienda de aplicaciones se llama <a href="https://f-droid.org/"> 1F-Droid</a> 2. Es un kit completo para una tienda de aplicaciones que incluye todas las herramientas <a href="https://f-droid.org/docs/"> 3documentation</a> 4 requeridas para abrir tu propia tienda de aplicaciones: un <a href="https://gitlab.com/fdroid/fdroidserver/"> 5 servidor para la tienda de aplicaciones </a> 6, la <a href="https://gitlab.com/fdroid/fdroidclient"> 7 aplicacion requerida </a> 8 para instalar las aplicaciones en tu telefono y una <a href="https://gitlab.com/fdroid/repomaker"> 9 herramienta de curacion </a> 0 para administrar la tienda con facilidad.

source: ![]({{ site.baseurl }}/assets/posts/2017-07-03-cuba/fdroid_repo.jpg)<br/> *DroidT's F-Droid Repository*
es: ![]({{ site.baseurl }}/assets/posts/2017-07-03-cuba/fdroid_repo.jpg)<br/> 1 *DroidT's Repositorio F-Droid *

source: Normally, the F-Droid app that you can download comes with thousands of useful Free Software apps without advertising and user tracking. These however require an internet connection to be downloaded from F-Droid's official server. Thankfully, F-Droid allows you to add other repositories to it. These work similar to the package repositories that you might know from GNU/Linux distributions. Everybody can create their own repository, even in an offline network. As long as people are connected to the same WiFi, they can use your repository to install and update your apps.
es: Generalmente, la aplicacion F-Droid que puedes descargar incluye miles de Aplicaciones de Software Libre utiles y sin anuncios y monitoreo de usuarios. Sinembargo esto requiere una conexion a internet para ser descargado de el servidor oficial de F-Droid. Afortunadamente, F-Droid te permite agregar otros repositorios. Esto funciona de manera similar a los paquetes repositorios que probablemente ya conoces de distribuciones GNU/Linux. Cualquiera puede crear su propio repositorio, incluso en una red sin acceso a Internet. Las personas pueden usar tu repositorio para instalar o actualizar aplicaciones siempre y conectadas al mismo WiFi.

source: ![]({{ site.baseurl }}/assets/posts/2017-07-03-cuba/antenna_outside_shop.jpg)<br/> *WiFi Antenna Outside of the Shop*
es: ![]({{ site.baseurl }}/assets/posts/2017-07-03-cuba/antenna_outside_shop.jpg)<br/> 1 * Antena WiFi afuera de la tienda*

source: This is exactly what the <a href="http://droid-tech.com/">DroidT shop</a> did that I visited in <a href="https://en.wikipedia.org/wiki/Sancti_Sp%C3%ADritus">Sancti Spíritus</a>, Cuba. They run their own repository within their local WiFi network. Currently, they offer more than 2000 apps, mostly games, but also other useful apps, for free to everybody within the range of their WiFi router. Having a worse store location than their competitors, it really helps them to drive people to their shop and to build up their reputation within the local community. So far, they are the only store in their city offering this free and convenient service to their customers.
es: Eso es exactamente lo que <a href="http://droid-tech.com/"> 1 la tienda DroidT </a> 2 que visite en <a href="https://en.wikipedia.org/wiki/Sancti_Sp%C3%ADritus"> 3 Sancti Spíritus</a> 4, Cuba hizo. Ellos operan su propio repositorio con una red local de WiFi. Actualmente, ofrecen mas de 2000 aplicaciones, la mayoria juegos, pero tambien otras aplicaciones utiles, de manera gratuita para cualquier persona en el radio de alcance de su router. Debido a que tienen una ubicacion menos conveniente que la de sus competidores, esto realmente les ayuda a atraer gente a su tienda y mejorar su reputacion en su comunidad. Por el momento, son la unica tienda en la ciudad ofreciendo este servicio gratuito y conveniente a sus clientes.

source: ![]({{ site.baseurl }}/assets/posts/2017-07-03-cuba/child_apps.jpg)<br/> *A Cuban child looking through the print-out of available apps*
es: ![]({{ site.baseurl }}/assets/posts/2017-07-03-cuba/child_apps.jpg)<br/> 1 *Un niño Cubano viendo la lista impresa de aplicaciones disponibles*

source: The apps are downloaded by the store employees once, put into the repository and then are available to an unlimited number of customers without ever needing to connect to the internet again. The DroidT team is even going the last mile by also offering Spanish app metadata such as summaries and app descriptions to make it easier for people to find the app that they are looking for.
es: Las aplicaciones son descargadas por los empleados de la tienda una vez, colocadas en el repositorio y despues estan disponibles para un numero ilimitado de clientes sin la necesidad de conectarse nuevamente a internet. El equipo de DroidT se esfuerza aun mas ofreciendo metadata en espanol de las aplicaciones como resumenes y descripciones de aplicaciones para ayudar a las personas a encontrar la aplicacion que estan buscando.

source: At the moment they work on making use of the new screenshot feature that was introduced to the F-Droid app recently, so their customers can browse through the screenshots before deciding whether to install an app or not.
es: Por el momento estan trabajando en hacer uso de la funcion nueva de imagenes de pantalla agregada a la aplicacion de F-Droid recientemente, para que sus clientes puedan ver las imagenes de pantalla antes de decidir si instalan la aplicacion o no.
