Repository: vecnathewhisperd0/fdroid-website
Catalog: po/_posts.*.po
Languages: bo, es, nb_no, zh_hant

source: The search field has changed to now be run by our own custom [search service](https://gitlab.com/fdroid/fdroid-website-search). This allows all aspects of the website to work with or without Javascript to support as wide a range of devices and browsers as possible, including Tor Browser and browsers on cheap mobile devices. This new search service also includes a much more complete index, so it is now possible to search based on all of the metadata, for example by license:
es: El campo de búsqueda ha cambiado para ser ahora ejecutado por nuestro propio [servicio de búsqueda] personalizado (https://gitlab.com/fdroid/fdroid-website-search). Esto permite que todos los aspectos del sitio web funcionen con o sin Javascript para admitir la mayor variedad de dispositivos y navegadores posibles, incluido el navegador Tor y navegadores en dispositivos móviles baratos. Este nuevo servicio de búsqueda también incluye un índice mucho más completo, por lo que ahora es posible buscar en base a todos los metadatos, por ejemplo, por licencia:

source: There is a lot that can be done to improve the search, we welcome contributions! For example, it would be nice to still offer the old, live search popup. That just requires someone fixing [this issue](https://gitlab.com/fdroid/fdroid-website/issues/175).
es: Hay mucho que se puede hacer para mejorar la búsqueda, ¡damos la bienvenida a las contribuciones! Por ejemplo, sería bueno seguir ofreciendo la ventana emergente de búsqueda que teniamos anteriormente . Eso solo requiere que alguien solucione [este problema](https://gitlab.com/fdroid/fdroid-website/issues/175).

source: Since all of the apps descriptions and graphics are submitted by developers, this website needs to have extra protections to ensure that the text and graphics that come from app developers cannot be used to exploit visitors of this website. To read more about the measures we take to ensure the security of this site, see the "Initial Install" section of [Security Model]({{ site.baseurl }}/docs/Security_Model).
es: Dado que todas las descripciones y los gráficos de las aplicaciones son enviados por los desarrolladores, este sitio web debe tener protecciones adicionales para garantizar que el texto y los gráficos que provienen de los desarrolladores de la aplicación no puedan utilizarse para explotar a los visitantes de este sitio web. Para obtener más información sobre las medidas que tomamos para garantizar la seguridad de este sitio, consulte la sección "Instalación inicial" de [Modelo de seguridad]({{ site.baseurl }}/docs/Security_Model).

source: Also: * Last Updated now changes properly * the permissions list per app version is now foldable * the F-Droid Donate section is not shown on the sidebar of app pages
es: Además: * Última actualización ahora cambia correctamente * la lista de permisos por versión de la aplicación ahora es plegable * la sección Donar F-Droid no se muestra en la barra lateral de las páginas de la aplicación

source: "Liberapay, a fully free Donation Platform"
es: "Liberapay, una plataforma de donación totalmente gratuita"

source: <p align="center"> <img width="150" src="{{ site.baseurl }}/assets/posts/2018-03-02-liberapay-support/liberapay_icon-v2_yellow-r.svg" style="box-shadow: unset;" /> </p>
es: <p align="center"> 1 <img width="150" src="{{ site.baseurl }}/assets/posts/2018-03-02-liberapay-support/liberapay_icon-v2_yellow-r.svg" style="box-shadow: unset;" /> 2 </p> 3

source: Recently F-Droid has gained support for [Liberapay](https://liberapay.com/), a fully free donation platform aimed at software projects. Liberapay itself is fully free and [open source](https://github.com/liberapay/liberapay.com) software focusing on recurrent donations to software projects. These recurrent donations are important for the long-term sustainability of projects. Another interesting feature for software projects is the possibility to create [teams](https://liberapay.com/about/teams) which the members of the project can join and then split the donations in a way where everyone sets the share he or she wants to take.
es: Recientemente, F-Droid ha ganado el apoyo de [Liberapay](https://liberapay.com/), una plataforma de donación totalmente gratuita destinada a proyectos de software. Liberapay en sí mismo es un software totalmente gratuito [de código abierto](https://github.com/liberapay/liberapay.com) que se enfoca en donaciones recurrentes a proyectos de software. Estas donaciones recurrentes son importantes para la sostenibilidad a largo plazo de los proyectos. Otra característica interesante para los proyectos de software es la posibilidad de crear [equipos](https://liberapay.com/about/teams) a los que los miembros del proyecto pueden unirse y luego dividir las donaciones de manera que todos establezcan la parte que él o ella quiere tomar.

source: The donation part of F-Droid has always relied on closed platforms like PayPal but not anymore!
es: Las donaciones para F-Droid en el pasado siempre se basaron en plataformas cerradas como Paypal, pero ya no mas!

source: Integration into F-Droid
es: Integracion en F-Droid

source: F-Droid now has full support for projects offering donation via Liberapay:
es: F-Droid ahora tiene soporte completo para proyectos que ofrecen donaciones a través de Liberapay:

source: The Liberapay ID of a person or team can be entered into a dedicated [metadata field](https://f-droid.org/en/docs/Build_Metadata_Reference/#LiberapayID). 10 apps in F-Droid already offer this as a donation option. Hopefully more will join soon.
es: El ID de Liberapay de una persona o equipo se puede ingresar en un [campo de metadatos] dedicado (https://f-droid.org/en/docs/Build_Metadata_Reference/#LiberapayID). 10 aplicaciones en F-Droid ya ofrecen esto como una opción de donación. Esperemos que más se unan pronto.

source: * The The android client now shows the Liberapay widget: <p align="center"> <img width="400" src="{{ site.baseurl }}/assets/posts/2018-03-02-liberapay-support/liberapay-client-screenshot.png" /> </p> * The website now includes [all donation options]({{ site.baseurl }}/2018/03/01/website-updates.html). * F-Droid itself has a [Liberapay team](https://liberapay.com/F-Droid-Data). After about two month we are already receiving ~30€/week, making us currently the third most funded [team](https://en.liberapay.com/explore/teams) on Liberapay.
es: * El cliente de Android ahora muestra el widget de Liberapay : <p align="center"> 1 <img width="400" src="{{ site.baseurl }}/assets/posts/2018-03-02-liberapay-support/liberapay-client-screenshot.png" /> 2 </p> 3 * El sitio web ahora incluye [todas las opciones de donación]({{ site.baseurl }}/2018/03/01/website-updates.html). * F-Droid tiene un [equipo Liberapay](https://liberapay.com/F-Droid-Data). Después de aproximadamente dos meses ya estamos recibiendo ~30€ por semana, lo que nos hace actualmente el tercer [equipo] más financiado (https://en.liberapay.com/explore/teams) en Liberapay.

source: Next steps
es: Siguientes pasos

source: Liberapay is still a young and very small platform (remember, we became the third most funded team in two months ;-)) so it needs both more projects and more patrons. So spread the word and [ask your favourite](https://github.com/TeamNewPipe/NewPipe/issues/1153) open source project if you can start giving them money through Liberapay.
es: Liberapay sigue siendo una plataforma joven y muy pequeña (recuerde, nos convertimos en el tercer equipo más financiado en dos meses ;-)) por lo que necesita tanto más proyectos como más clientes. Así que corra la voz y [pregunte a proyecto su favorito](https://github.com/TeamNewPipe/NewPipe/issues/1153) de código abierto si puede comenzar a darles dinero a través de Liberapay.

source: Do you know any app or developer with a Liberapay account that is not yet shown in F-Droid? Help us by adding it to the [apps metadata](https://gitlab.com/fdroid/fdroiddata).
es: ¿Conoces alguna aplicación o desarrollador con una cuenta de Liberapay que aún no se muestre en F-Droid? Ayúdenos agregándolo a [metadatos de aplicaciones](https://gitlab.com/fdroid/fdroiddata).

source: You can also fund the further development of Liberapay through Liberapay itself here: <a href="https://liberapay.com/Liberapay/"><img src="{{ site.baseurl }}/assets/liberapay_donate_button.svg" style="box-shadow: unset;" /></a>
es: También puede financiar el mayor desarrollo de Liberapay a través de Liberapay aquí: <a href="https://liberapay.com/Liberapay/"> 1 <img src = "{{ site.baseurl }}/assets/liberapay_donate_button.svg" style = "box-shadow: unset;" /> 2 </a> 3

source: Google created OBB aka "[APK Expansion](https://developer.android.com/google/play/expansion-files.html)" files to provide a flexible means of delivering large amounts of data. This arragement also saves lots of bandwidth since the APK file and the OBB file can be updated separately. For example, a game's assets do not need to change often, so they can be shipped as an OBB. Then when the app itself is updated (i.e. the APK), it does not need to include all those assets that are in the OBB file.
bo: གྷུ་གྷལ་གྱིས་OBB aka "[APK Expansion]བཟོས་ཡོད། (https://developer.android.com/google/play/expansion-files.html)"འདི་ནི་ཡིག་ཆ་ཕོན་ཆེན་པོ་ཡོད་པ་དེ་དག་སྟབས་བདེ་པོའི་ངང་ནས་གཏོང་ཐུབ་ཀྱ་ཡོད། APK ཡིག་ཆ་དང་OBB ཡིག་ཆ་གཉིས་སོ་སོ་ནས་གསར་བསྒྱུར་བྱེད་ཐུབ་ཀྱི་ཡོད་ཙང་། འདི་གྲ་སྒྲིག་བྱས་པས་bandwith མང་པོ་ཉར་ཚགས་ཐུབ་ཀྱི་ཡོད། དཔེར་ན། རྩེད་ཆས་ཀྱི་ཁྱད་ཆོས་རིགས་རྣམས་ཡང་སེ་བརྗེ་པོ་རྒྱབ་དགོས་ཀྱི་མེད། སོང་ཙང་དེ་ཚོ་OBBཡིས་སྐྱེལ་འདྲེན་བྱེད་ཐུབ། དེའི་རྗེས་སུ་མཉེན་ཆས་དེ་ག་རང་གསར་བསྒྱུར་བྱས་པའི་སྐབས་སུ (དེ་ནི་ APK) OBB ཡིག་ཆའི་ནང་དུ་ཡོད་པའི་མཉེན་ཆས་ཀྱི་ཁྱད་ཆོས་དེ་དག་འདིའི་ནང་ཚུད་དགོས་ཀྱི་ཡོད་པ་མ་རེད།.
zh_hant: Google 創建了又名「[APK 擴展](https://developer.android.com/google/play/expansion-files.html)」的 OBB 檔案，使傳送大量資料時更具彈性。這樣的安排也能節省頻寛，因為 APK 檔和 OBB 檔可以各自分開更新。例如，某個遊戲的資源不會經常變動，因此可以作成一個 OBB。當此應用更新時（即 APK），它無需包含存在 OBB 檔案的資源。
