Repository: vecnathewhisperd0/fdroid-website
Catalog: po/_posts.*.po
Languages: bo, es, nb_no, zh_hant

source: "F-Droid supports APK Expansion Files aka OBB"
bo: "ཨིཕ་རོཌ་གྱིས་APKཡིག་ཆ་རྒྱ་སྐྱེད་ aka OBB རྒྱབ་སྐྱོར་བྱེད་ཀྱི་ཡོད།
es: "F-Droid admite archivos de expansión APK Expansion Files, también llamados OBB"
nb_no: "F-Droid støtter APK-utvidelsesfiler kalt OBB"
zh_hant: "F-Droid 支援 APK 擴展檔案，又名 OBB"

source: Many games, mapping, and other apps require a large amount of data to work. The APK file of an Android app is limited to 100MB in size, yet it is common for a single country map file to be well over 100MB. Also, in order to get users running as quickly as possible, they should not have to wait for huge amounts of data to download in order to just start the app for the first time.
bo: རྩེད་ཆས་དང་ས་ཁྲ་བཟོ་བ། དེ་བཞིན་མཉེན་ཆས་གཞན་མང་པོའི་ནང་ལས་ཀ་བྱེད་པར་ཡིག་ཆའི་རིགས་ཕོན་ཆེན་པོ་དགོས་ཀྱི་ཡོད། ཨེན་ཀྲོཌ་མཉེན་ཆས་གྱི་APK ཡིག་ཆ་རྣམས་ཆེ་ཆུང་ཚད་གཞི་1OOMB བར་དུ་ཡོད་པ་རེད། ཡིན་ནའང་ཡོངས་གྲགས་ལ་ལུས་པ་གཅིག་གི་ས་ཁྲའི་ཡིག་ཆ་གཅིག་པུ་ལ་ཆེ་ཆུང་100MB ལས་མང་བ་ཡོད། དེས་མ་ཟད་སྤྱོད་པ་པོ་རྣམས་ཀྱིས་ག་ཚོད་ཐུབ་ཐུབ་ཀྱི་མགྱོགས་བེད་སྤྱོད་གཏོང་ཐུབ་པའི་ཆེད་དུ་མཉེས་ཆས་ཐོག་མར་ཁ་ཕྱེས་པའི་སྐབས་སུ་ཡིག་ཆ་ཕོན་ཆེན་པོ་ཕབ་ལེན་བྱས་པ་ལ་འགུག་དགོས་མེད།.
es: Muchos juegos, aplicaciones de mapas y demás requieren grandes cantidades de datos para funcionar. El tamaño del archivo APK para una aplicación de Android está limitado a 100 MB de tamaño, pero normalmente el mapa de un solo país ya ocupa más que eso. Además, para no interrumpir a los usuarios, no deben esperar a que se descarguen grandes cantidades de datos solo para iniciar por primera vez una aplicación.
nb_no: Mange spill, tastatursnarveier, og andre programmer trenger store mengder data for å virke. APK-filen tilhørende et Android-program begrenser seg til 100MB størrelse, likevel er det vanlig for et vanlig landskart å overskride 100MB. For å få brukere i gang så fort som mulig, bør de ikke måtte vente på store mengder data å laste ned for å kunne starte programmet for første gang.
zh_hant: 許多遊戲、地圖或其它應用程式需要大量的資料運行。Android的 APK 檔案大小不可超過 100MB，但通常一個國家的地圖檔就不只100MB。此外，為了讓使用者能快速執行，不必在首次啟用應用時要等上一段時間來下載大量的資料。

source: Google created OBB aka "[APK Expansion](https://developer.android.com/google/play/expansion-files.html)" files to provide a flexible means of delivering large amounts of data. This arrangement also saves lots of bandwidth since the APK file and the OBB file can be updated separately. For example, a game's assets do not need to change often, so they can be shipped as an OBB. Then when the app itself is updated (i.e. the APK), it does not need to include all those assets that are in the OBB file.
es: Google creó los archivos OBB, también llamados "[expansiones de APK](https://developer.android.com/google/play/expansion-files.html)", para proveer de un método flexible para distribuir grandes cantidades de datos. Esta solución también ahorra ancho de banda, ya que APK y OBB pueden actualizarse por separado. Por ejemplo, los recursos de un juego no necesitan cambiar a menudo, así que se pueden enviar en OBB. Así cuando la aplicación se actualice (es decir, el APK), no se necesita volver a descargar esos recursos porque ya están en el archivo OBB.
nb_no: Google opprettet OBB-filer aka "[APK-utvidelse](https://developer.android.com/google/play/expansion-files.html)" for å tilby en fleksibel løsning for levering av store mengder data. Dette arrangementet sparer store mengder båndbredde siden APK-fila og OBB-fila kan oppdateres hver for seg. For eksempel, trenger ikke ting som tilhører spill å endres særlig ofte, så de kan leveres som en OBB. Når selve programmet oppdateres (altså selve APK-en), trenger ikke de filene å inkluderes der.

source: OBB files are used by lots of apps like games and MAPS.ME. F-Droid supports OBB by downloading and installing the OBB before the APK, so that once the APK is installed, the OBB files are already in place and ready to use. F-Droid also provides an `Intent` method for apps to fetch the OBB download URLs in case the app itself needs to handle the OBB download/update. That is similar to how it works in Google Play.
bo: OBB ཡིག་ཆ་འདི་རྩེད་ཆས་དང་MAPS.ME སོགས་མཉེན་ཆས་མང་པོས་བེད་སྤྱོད་བྱེད་ཀྱི་ཡོད་པ་རེད། ཨེཕ་རོཌ་ཡིས་OBB ངོས་ལེན་བྱེད་ཀྱི་ཡོད་ལ། དེ་ཡང་APK ཕབ་ལེན་དང་འགྲིག་བཅུག་མ་བྱེད་གོང་ནས་OBB་ཕབ་ལེན་དང་འགྲིག་བཅུག་བྱེད་ཀྱི་ཡོད། གལ་སྲིད་མཉེས་ཆས་ཁོ་རང་རང་གིས་OBBཕབ་ལེན་/གསར་བསྒྱུར་བྱེད་དགོས་པའི་ཚེ། ཨེཕ་རོཌ་ཡིས་མཉེས་ཆས་འདིས་OBB ཕབ་ལེན་ URLs ལེན་པའི་ཆེད་དུ་ "དགོས་དོན་"ཀྱི་ཐབས་ལམ་ཞིག་ཀྱང་སྟོན་གྱི་ཡོད། འགྲོ་ལུགས་འདི་ནི་གྷུ་གྷལ་རྩེད་ཆས་ནང་གི་ལས་ཀ་བྱེད་སྟངས་དང་གཅིག་མཚུངས་ཆགས་ཀྱི་ཡོད་པ་རེད།.
es: Los archivos OBB son aprovechados por muchas aplicaciones como juegos y MAPS.ME. F-Droid soporta la descargarga e instalación de los OBB antes que el APK, así una vez que el APK está instalado los OBB ya están en su lugar y preparados para usarse. F-Droid también provee de métodos `Intent` para que las aplicaciones consulten las direcciones de descarga de los OBB, por si la aplicación necesita manejar las actualizaciones de OBB por sí misma. Google Play usa un método similar.
nb_no: OBB-filer brukes av en mengde programmer som spill og MAPS.ME. F-Droid støtter OBB ved å laste ned og installere OBB-en før APK-en, slik at når APK-en først er installert, er OBB-filene allerede på plass klare til bruk. F-Droid tilbyr også en "hensikt"smetode for at programmer skal kunne hente OBB-nedlastningers nettadresser i fall selve programmer trenger å hanskes med OBB-nedlasting/oppdatering. Dette ligner hvordan det virker i Google Play.
zh_hant: 許多遊戲及 MAPS.ME 等的應用程式都使用 OBB 檔案。F-Droid 將在處理 APK 檔案前先下載和安裝 OBB，以使 OBB 檔案在安裝好 APK 時已經準備就緒，以供使用。F-Droid 更為提供 `刻意` 的方式，讓應用程式可以存取 OBB 的下載網址。此方式可以使應用程式獨立地處理 OBB 下載和更新，與 Google Play 的處理方法相近。

source: In order to use the OBB support, users need at least F-Droid v0.102, and the repo must use _fdroidserver_ v0.7.0 or newer. Adding OBB files to a repo is very easy: just copy them to the same folder where the APKs go, i.e. _/path/to/fdroid/repo/_.
bo: OBB རྒྱབ་སྐྱོར་བེད་སྤྱོད་བྱེད་པ་ལ་སྤྱོད་པ་པོར་མ་མཐའ་ཡིན་ཡང་ཨེཕ་རོཌ་ཐོན་v0.102 འདི་དགོས་པ་དང་། རེ་པོ་ཐོན་_fdroidserver_ v0.7.0 འདི་འམ་ཡང་ན་འདི་ལས་ཐོན་གསར་བ་ངེས་པར་དུ་བེད་སྤྱོད་བྱེད་དགོས། རེ་པོ་སྒང་ལ་OBB ཡིག་ཆ་ཁ་སྣོན་བྱེད་རྒྱུ་ལས་སླ་པོ་རེད།:APKs འགྲོ་སའི་ཡིག་ཁུག་དེ་ག་རང་ལ་ཕབ་ཤུས་བྱེད་_/path/to/fdroid/repo/_.
es: Para usar el soporte de OBB, los usuarios necesitan al menos la versión 0.102 de F-Droid, y el repo debe usar la versión 0.7.0 o mayor de _fdroidserver_. Añadir archivos OBB a un repo es muy fácil: solo cópialos a la misma carpeta donde están los APK, o lo que es lo mismo, _/path/to/fdroid/repo/_.
nb_no: For å kunne bruke OBB-støtte, trenger brukere minst F-Droid v0.102, og pakkebrønnen må bruke _fdroidserver_ v0.7.0 eller nyere. Å legge til OBB-filer til en pakkebrønn er veldig lett: Bare kopier dem til samme mappen som APK-filene er i, altså _/sti/til/fdroid/pakkebrønn/_.
zh_hant: F-Droid 0.102 或更新版才支援 OBB，軟體倉庫必須使用 _fdroidserver_ 0.7.0 或更新版。在倉庫新增 OBB 檔案非常簡單：您只需要將 OBB 檔案複製至 APK 檔案所在的資料夾（如： _/path/to/fdroid/repo/_）。

source: Developer Usage
bo: བཟོ་མཁན་གྱི་ལམ་སྲོལ།
es: Uso del desarrollador
nb_no: Utviklerbruk
zh_hant: 針對開發者的使用

source: One of the details about using OBB files in apps is that OBB files are not guaranteed to be installed by the app store. That means the app could start, and the expected OBB files will not be there. In that case, the app must download and install the OBB file itself. Google Play recommends using their proprietary [Application Licensing](https://developer.android.com/google/play/licensing/index.html) service for this, F-Droid provides a simple method that is all free software.
bo: མཉེས་ཆས་ཀྱི་ནང་ལ་OBB ཡིག་ཆ་བེད་སྤྱོད་གཏོང་དགོས་པའི་རྒྱུ་མཚན་ནི་མཉེས་ཆས་གསོག་ཉར་ཁང་ནས་OBB ཡིག་ཆ་འགྲིག་བཅུག་བྱེད་པའི་ངེས་པ་མེད་པའི་རྐྱེན་གྱིས་རེད། སོང་ཙང་མཉེས་ཆས་འགོ་བཙུགས་ཐུབ་ཀྱང་དེའི་ནང་རེ་སྒུག་བྱེད་པའི་OBBཡིག་ཆ་འདིའི་ནང་མེད། གནས་སྐབས་དེ་འདྲའི་སྐབས་སུ་མཉེས་ཆས་འདི་ངེས་པར་དུ་ཕབ་ལེན་བྱས་ནས་OBB ཡིག་ཆ་འགྲིག་བཅུག་བྱེད་དགོས། གྷུ་གྷལ་མཉེན་ཆས་ཀྱིས་ཀྱང་དེ་ལྟར་ལམ་སྟོན་བྱེད་ཀྱི་ཡོད། [མཉེན་ཆས་ཆོག་མཆན་ལག་ཁྱེར།] (https://developer.android.com/google/play/licensing/index.html)ཨེཕ་རོཌ་གྱིས་ཐབས་ལམ་ལས་སླ་པོའི་ཐོག་ནས་མཉེན་ཆས་རིན་མེད་སྟེར་གྱི་ཡོད།
es: Un detalle importante sobre usar archivos OBB en aplicaciones es que no se garantiza que la tienda de aplicaciones instale los OBB. Eso significa que la aplicación puede iniciarse y que los OBB necesarios no estén aún preparados. En ese caso, la aplicación debe descargar e instalar los OBB por sí misma. Google Play recomienda usar su servicio propietario de [autorización de aplicaciones](https://developer.android.com/google/play/licensing/index.html) para esto, F-Droid provee de un sistema sencillo que es software libre.
nb_no: En av detaljene vedrørende bruk av OBB-filer i programmer er at OBB-filer ikke er garantert å bli installert av programbutikken. Det betyr at programmet kan starte, uten at den forventede OBB-fila er der. I sådant fall, vil programmet laste ned og installere selve OBB-fila på egenhånd. Google Play anbefaler deres proprietære [Programlisensieringstjeneste](https://developer.android.com/google/play/licensing/index.html) for dette, F-Droid derimot tilbyr en enkel metode som er fri programvare tvers igjennom.
zh_hant: 在應用程式中使用 OBB 檔案時，要注意應用程式商店不一定會安裝 OBB 檔案。未能夠安裝 OBB 檔案的應用程式是可以啟動的，但不會找到所需的 OBB 檔案。這個情況下，該應用程式必須自行下載和安裝 OBB 檔案。Google Play 建議在下載和安裝 OBB 檔案時使用他們的專用[應用程式許可](https://developer.android.com/google/play/licensing/index.html) 服務，但 F-Droid 則提供一個使用自由軟體的簡單方法。

source: To get the URL for the two possible OBB files, send an `Intent` to F-Droid using these _Actions_:
bo: URL དེ་བཞིན་OBBཡིན་མཁན་གྱི་ཡིག་ཆ་གང་རུང་གཉིས་ལ་ཐོབ་པ་ལ། ཨེཕ་རོཌ་ལ་སྒང་ལ་_བྱ་བ་_འདི་བེད་སྤྱོད་བྱས་ནས་ 'དགོས་དོན་ 'གཏོང་།:
es: Para obtener la dirección de los dos archivos OBB posible, envía un `Intent` a F-Droid con estas _Actions_:
nb_no: For å hente nettadressen for de to mulige OBB-filene, send en "hensikt" til F-Droid ved bruk av disse _Handlingene_:
zh_hant: 要取得兩個可能的 OBB 檔的 URL 位置，使用 these _Actions_ 來傳送 `Intent` 到 F-Droid：

source: Then download that URL using your favorite method, and make sure that the file ultimately ends up in _Android/obb/<packageName>_ on the device's External Storage.
bo: ཁྱེད་རང་གིས་དགའ་མོས་ཆེ་ཤེས་ཀྱི་ཐབས་ལམ་བེད་སྤྱོད་བྱས་ཏེ་དེ་ནས་URL ཕབ་ལེན་བྱེད། ངེས་དགོས་པ་ཞིག་ལ་ ཡིག་ཆ་དེ་མཐའ་མར་_Android/obb/<packageName>_ ནང་གི་ ཕྱིའི་གསོག་ཆས་སྒང་ལ་ངེས་པར་དགོས།
es: Después, descarga de esa dirección usando tu método preferido, y asegúrate de que el archivo termine en _Android/obb/<nombreDelPaquete>_ en la memoria externa del dispositivo.
nb_no: Last så ned nettadressen ved bruk av din favorittmetode, og forsikre deg så om at fila til slutt havner i _Android/obb/<pakkenavn>_ på enhetens eksternlager.
zh_hant: 利用習慣的方式開啟 URL 下載, 確保檔案會自動地存放於 _Android/obb/&lt;packageName&gt;_ on 設備的外部儲存空間。

source: "Sailing into a new decade of discussions"
bo: "བཅུ་ཕྲག་གསར་པའི་བགྲོ་གླེང་ནང་ལ་དལ་སྐྱོད་བྱེད་བཞིན།"
es: «Partiendo hacia una nueva década de debates»
nb_no: "Innseiling i et nytt tiår med diskusjoner"
zh_hant: "航行在新世代的討論區吧"

source: We are excited to announce the release of the new official F-Droid forum: [forum.f-droid.org](https://forum.f-droid.org).
bo: ང་ཚོས་དགའ་ཚོར་ཆེན་པོའི་ཐོག་ནས་གཞུང་འགྲེལ་གྱིས་ཨེཕ་རོཌ་གླེང་སྟེགས་གསར་པ་འདི་བཞིན་འགྲེམ་སྤེལ་ཞུ་རྒྱུའི་གསལ་བསྒྲགས་བྱེད་རྒྱུ་ཡིན།: [forum.f-droid.org](https://forum.f-droid.org).
es: Nos emociona anunciar el lanzamiento del nuevo foro oficial de F-Droid: [forum.f-droid.org](https://forum.f-droid.org).
zh_hant: F-Droid 官網上新版的論壇已正式對外發佈: [forum.f-droid.org](https://forum.f-droid.org).

source: We have been working hard to [revise the website](https://gitlab.com/groups/fdroid/milestones/launch?title=Launch) in order to make it easier to modernize, accept contributions, and internationalise. The main part of this is switching the underlying technology from WordPress to [Jekyll](https://jekyllrb.com/). However, this caused us to think about the forum as it was powered by a WordPress plugin. Quickly [we decided to drop the old forum](https://gitlab.com/fdroid/fdroid-website/issues/6) in favor of an indepentently hosted one and chose some modern software called [Discourse](https://www.discourse.org).
bo: ང་ཚོས་དྲྭ་རྒྱ་ལེགས་བཅོས་གཏོང་ཐབས་སུ་འབད་རྩོལ་ཆེན་པོ་བྱེད་ཀྱི་ཡོད། (https://gitlab.com/groups/fdroid/milestones/launch?title=Launch)དེ་ཡང་བེད་སྤྱོད་གཏོང་བདེ་བ་དེང་རབས་དང་མཐུན་པ། རོགས་རམ་ངོས་ལེན་བྱེད་ཐུབ་པ། རྒྱལ་སྤྱི་དང་མཐུན་པ་བཟོ་ཐབས་ལ་འབད་རྩོལ་བྱེད་ཀྱི་ཡོད། ལས་ཀ་གཙོ་བོ་ནི་རྨང་གཞིའི་འཕྲུལ་ཆས་འདི་word press ནས་Jekyll](https://jekyllrb.com/).ལ་བརྗེ་ལེན་བྱེད་རྒྱུ་དེ་རེད། འོན་ཀྱང་གླེང་སྟེགས་འདིས་WordPress ནང་བཙུགས་བེད་སྤྱོད་བྱེད་ཀྱི་ཡོད་ཙང་ང་ཚོས་བསམ་བློ་བཏང་ནས་[གླེང་སྟེགས་རྙིང་པ་དེ་གཡུག་ནས་](https://gitlab.com/fdroid/fdroid-website/issues/6) རང་དབང་ལྡན་པའི་ཉར་གསོག་འདི་བེད་སྤྱོད་བྱེད་པ་མ་ཟད་དེང་དུས་དང་མཐུན་པའི་མཉེན་ཆས་[Discourse](https://www.discourse.org)བེད་སྤྱོད་བྱེད་ཡོད།
es: Hemos trabajado duro para [revisar el sitio web](https://gitlab.com/groups/fdroid/milestones/launch?title=Launch) con el objetivo de hacer más fácil modernizarlo, aceptar contribuciones e internacionalizarlo. La diferencia principal es el cambio de la tecnología subyacente de Wordpress a [Jekyll](https://jekyllrb.com/). Sin embargo, tuvimos que pensar qué hacer con el foro, que funcionaba gracias a un plugin de WordPress. Rápidamente [decidimos abandonar el foro antiguo](https://gitlab.com/fdroid/fdroid-website/issues/6) en favor de uno alojado de manera independiente y elegir un software moderno llamado [Discourse](https://www.discourse.org).
nb_no: Vi har jobbet hardt for å [fornye nettsiden](https://gitlab.com/groups/fdroid/milestones/launch?title=Launch) for å gjøre den enklere å modernisere, godta bidrag, og internasjonalisere. Hoveddelen av dette arbeidet er å bytte den bakenforliggende teknologien fra WordPress til [Jekyll](https://jekyllrb.com/). Dette fikk oss på tanken om å gjøre noe med forumet, siden det ble drevet av et WordPress-programtillegg. Raskt [besluttet vi å droppe det gamle forumet](https://gitlab.com/fdroid/fdroid-website/issues/6) til fordel for et vi selv er vertskap for, og valgte i så måte den moderne programvaren kalt [Discourse](https://www.discourse.org).
zh_hant: 我們努力地[重整網站](https://gitlab.com/groups/fdroid/milestones/launch?title=Launch)以調整成更現代化，易於參與貢獻和多國化環境。主要的部份是把網站由從 WordPress 改成 [Jekyll](https://jekyllrb.com/)。 但原本網站使用的論壇是依靠 WordPress 外掛元件所搭造出來。[我們很快地決定要打掉舊有論壇區](https://gitlab.com/fdroid/fdroid-website/issues/6) 找一個獨立可自主運作的工具，故挑選了[Discourse](https://www.discourse.org).

source: The old forum had a lot of disadvantages: Firstly, you cannot reply by mail. Secondly, the F-Droid volunteers had to waste time deleting massive amounts of spam (the old forum had 25% spam). Finally, the overall user experience was bad, and not only because of increasing number of bugs found in the forum software.
bo: གླེང་སྟེགས་སྙིང་པ་དེའི་སྒང་ལ་སྐྱོན་ཆ་མང་པོ་ཡོད།:དང་པོ་དེར་ཁྱེད་རང་གིས་གློག་འཕྲིན་རྒྱུད་དེ་ཡིག་ལན་གཏོང་མི་ཐུབ། གཉིས་པ་དེར་ཨེཕ་རོཌ་དྭངས་བླངས་པ་ཚོས་དུས་ཚོད་མང་པོ་ཞིག་ཡིག་རྙོག་ཕོན་ཆེན་པོ་སུབས་ཆེད་དུ་གཏོང་དགོས་ཀྱི་ཡོད་པ་རེད། (གླེང་སྟེགས་རྙིང་པ་དེའི་སྒང་ལ་ཡིག་རྙོག་བརྒྱ་ཆ་25%ཡོད་པ་རེད།) མཐའ་མར་མཉེན་ཆས་ཀྱི་གླེང་སྟེགས་ནང་ལ་སྐྱོན་མང་དུ་མང་དུ་ལྷག་པའི་རྐྱེན་གྱིས་བེད་སྤྱོད་གཏོང་མཁན་ཁྱོན་ཡོངས་གིས་ཡག་པ་མེད་པའི་ཚོར་བ་ཤུགས་ཆེ་བྱུང་ཡོད།.
es: El foro antiguo tenía un montón de desventajas: primero, no se podría responder por correo electrónico; segundo, los voluntarios de F-Droid tenían que perder tiempo borrando grandes cantidades de spam (un 25 % de mensajes lo eran); finalmente, la experiencia de usuario en general era mala, y no solo por el ascendiente número de errores del software del foro.
nb_no: Det gamle forumet hadde en mengde bakdeler: Først kan du ikke svare per e-post. Videre måtte F-Droid-frivillige bruke mye tid på å slette store mengder spam (der gamle forumet hadde 25% spam). Til sist, var den helhetlige brukeropplevelsen dårlig, ikke bare på grunn av det økende antallet feil i forumprogramvaren.
zh_hant: 舊有的討論區有許多缺點：首先, 使用者無法利用郵件回應。再者，F-Droid 志願者要花上不少時間來清理大量的垃圾訊息 (約有 25%是無用的垃圾訊息)。最後，整體的使用者體驗不良，其問題不只是論壇軟體本身有越來越多的毛病。

source: With Discourse, we hope to breathe life back into the F-Droid community. While app submissions recently [moved to GitLab](https://gitlab.com/fdroid/rfp), and bug reports/feature requests still live in GitLab, the new forum is the new centre for all discussions related to F-Droid. All users of F-Droid, whether discussing the client or the server tools, can help each other there.
bo: དེས་ན་གླེང་སྟགས་གསར་འདིས་ ང་ཚོས་ཨེཕ་རོཌ་ཚོགས་པའི་ནང་ལ་སླར་ཡང་འཚོ་ཤུགས་གསར་པ་འབྱིན་རྒྱུའི་རེ་བ་བྱེད་ཀྱི་ཡོད། ཉེ་ཆར་མཉེས་ཆས་འདི་[གིཊ་ལེབ་ལ་གནས་སྤོས་](https://gitlab.com/fdroid/rfp)བྱས་པའི་སྐབས་སུ་སྔར་གྱི་སྐྱོན་ཆའི་སྙན་ཐོ་ཁག་/རེ་སྐུལ་ཞུས་པའི་ཁྱད་ཆོས་རྣམས་ད་དུང་ཡང་གིཊ་ལེབ་ནང་ཡོད། གླེང་སྟེགས་གསར་པ་འདི་ནི་ཨེན་ཀྲོཌ་དང་འབྲེལ་བའི་སྐོར་གྱི་བགྲོ་གླེང་བྱས་སའི་ཚོགས་པ་གསར་པ་ཞིག་ཆགས་ཡོད། ཨེན་ཀྲོཌ་སྤྱོད་མཁན་ཚང་མས་མཉེན་ཆས་སམ་ཡང་ན་ཞབས་ཞུ་ལག་ཆའི་སྐོར་ལ་བགྲོ་གླེང་གང་བྱས་ཀྱང་ཕན་ཚུན་ཕན་ཐོགས་བྱེད་ཐུབ་ཀྱི་ཡོད།
es: Con Discourse, esperamos dar un soplo de vida a la comunidad de F-Droid. Mientras que el registro de aplicaciones [se movió a GitLab](https://gitlab.com/fdroid/rfp) recientemente, y los avisos de errores y peticiones de mejoras se mantienen en GitLab, el renovado foro es el nuevo centro de los debates relacionados con F-Droid. Todos los usuarios de F-Droid, tanto para hablar sobre el cliente o las herramientas del servidor, pueden ayudarse mutuamente allí.
nb_no: Med Discourse, håper vi å puste liv i F-Droid-gemenskapen. Samtidig som nye programinnsendelser har [flyttet til GitLab](https://gitlab.com/fdroid/rfp), og feilrapporter/funksjonsforespørsler fremdeles er å finne der, er forumet det nye senteret for diskusjoner vedrørende F-Droid. Alle F-Droid-brukere, enten de diskuterer klienten eller tjenerverktøyene, kan hjelpe hverandre der.
zh_hant: 利用 Discourse, 希望可以找回 F-Droid 社群的活力生氣。 而 應用提送則最近[移往 GitLab](https://gitlab.com/fdroid/rfp), 關於出錯回報/新功能請求 則繼續留在 GitLab。這個新論壇是用來討論交流 F-Droid相關話題的活動中心。F-Droid 所有使用者，不管想討論客戶端應用或是伺服器工具，皆可在此互相切磋協助。

source: Because of temporary limitations of all F-Droid volunteers it was not possible to move the old forum data to the new one which means that you have to re-register yourself. Independent from this all old topics remain at the current URLs for now.
bo: ད་ལྟ་གནས་སྐབས་ཀྱི་རིང་ལ་ཨེཕ་རོཌ་དངས་བླངས་ཞབས་ཞུ་བ་མི་ལྡང་བའི་རྒྱུ་མཚན་གྱིས་ཡིག་ཆ་རྣམས་གླེང་སྟེགས་རྙིང་པ་དེ་ནས་གསར་པའི་སྒང་ལ་གནས་སྤོས་བྱེད་ཐབས་མིན་འདུག་པས་ཁྱེད་རང་སོ་སོ་རང་ཉིད་ནས་དེབ་སྐྱེལ་གནང་རོགས། འདི་ལ་མ་ལྟོས་ན་བརྗོད་གཞི་རྙིང་པ་ཚང་མ་ད་ལྟ་ཡོད་བཞིན་པའི་URL སྒང་ལ་གནས་ཀྱི་ཡོད།
es: A causa de las limitaciones de tiempo de los voluntarios de F-Droid, no se han podido migrar los datos del foro antiguo al nuevo, lo que significa que tendrás que volver a registrarte manualmente. Independientemente de esto, los temas antiguos permanecen en las antiguas direcciones web por ahora.
nb_no: På grunn av midlertidige begrensninger for alle F-Droid-frivillige, var det ikke mulig å flytte den gamle forumdataen over til det nye forumet, hvilket betyr at du må registrere deg selv igjen. Uavhengig av dette er alle gamle emner å finne på den nåværende nettadressen inntil videre.
zh_hant: 考慮到全部 F-Droid 志願者的限制，無法把舊資料自動轉入新論壇，所以必須自行在新論壇重新註冊，而所有舊論壇區的討論主題現在仍然維持目前的 URLs。

source: One interesting new feature is [local communities](https://forum.f-droid.org/c/other-languages). In these communities you can discuss in your mother tongue about all topics related to F-Droid and free software on Android. At the moment there is already a [German group](https://forum.f-droid.org/c/other-languages/german).
bo: ཡིད་མགུ་ནུས་པའི་ཁྱད་ཆོས་གཅིག་ནི་[སྤྱི་ཚོགས་བསྟི་གནས་](https://forum.f-droid.org/c/other-languages)་སྤྱི་ཚོགས་འདི་ཚོའི་ནང་ལ་ཨེཕ་རོཌ་དང་ཨེན་ཀྲོཌ་སྒང་ལ་ཡོད་པའི་རིན་མེད་མཉེན་ཆས་ཀྱི་སྐོར་གྱི་བརྗོད་གཞི་རྣམས་རང་རང་སོ་སོའི་མ་སྐད་ཐོག་ནས་བགྲོ་གླེང་བྱེད་ཐུབ་ཀྱི་ཡོད། ད་ལྟའི་ཆ་ལ་སྔོན་ཚོད་ནས [ཇར་མན་སྡེ་ཚན་](https://forum.f-droid.org/c/other-languages/german)ཡོད།
es: Una interesante novedad son las [comunidades locales](https://forum.f-droid.org/c/other-languages). En estos espacios puedes conversar en tu lengua materna sobre todos los temas relacionados con F-Droid y con el software libre en Android. En este momento hay ya un [grupo en alemán](https://forum.f-droid.org/c/other-languages/german).
nb_no: Én interessant ny funksjon er [lokale gemenskaper](https://forum.f-droid.org/c/other-languages). I disse kan du diskutere ditt morsmål om alle emner som har med F-Droid og fri programvare på Android å gjøre. For øyeblikket finnes det allerede en [tysk gruppe](https://forum.f-droid.org/c/other-languages/german).
zh_hant: 一個有趣的新功能是[本地社區](https://forum.f-droid.org/c/other-languages).在社區裏用戶可以用自己的母語來討論與 F-Droid 相關的話題以及 Android 上的自由軟體。目前已成立了[德語小組](https://forum.f-droid.org/c/other-languages/german).

source: If you want to create your own local community, please open a topic in the ["Other languages" category](https://forum.f-droid.org/c/other-languages) and we will discuss everything else there.
bo: གལ་སྲིད་ཁྱེད་རང་གིས་རང་སོ་སོའི་སྤྱི་ཚོགས་བསྟི་གནས་བཟོ་འདོད་ཡོད་ན། བརྗོད་གཞི་ཞེས་པ་ནང་དུ་ཁ་ཕྱེས་རོགས་གནང ["སྐད་རིགས་གཞན་" སྡེ་ཚན](https://forum.f-droid.org/c/other-languages)དེ་ནས་ང་ཚོས་འདིའི་ནང་ལ་གནད་དོན་ཚང་མ་བགྲོ་གླེང་བྱེད་ཆོག
es: Si quieres crear tu propia comunidad local, por favor, abre un tema en la [categoría «Other languages» (Otros lenguajes)](https://forum.f-droid.org/c/other-languages) y debatiremos sobre ello allí.
nb_no: Hvis du ønsker å opprette din egen språklige avgreining, åpne et emne i ["Andre språk"-kategorien](https://forum.f-droid.org/c/other-languages), så kan vi diskutere videre der.
zh_hant: 如果想要創建自己的社區，請在 ["Other languages" 類別](https://forum.f-droid.org/c/other-languages)下開一則新主題，以便利用它來討論相關大小事。

source: Finally, there is one last insight into the current development of F-Droid: we plan to use Discourse for [comments on the website](https://gitlab.com/fdroid/fdroid-website/issues/36) which gets us closer to [comments on single applications](https://gitlab.com/fdroid/fdroidclient/issues/646).
bo: མཐའ་དོན་ལ། ད་ལྟ་ཡར་རྒྱས་གོང་སྤེལ་གཏོང་བཞིན་པའི་ཨེཕ་རོཌ་ནང་གྱི་ཤེས་བྱ་མཐའ་མ་དེ་ལ་:ང་ཚོས་གླེང་མོལ་གྱི་ལམ་ནས་[དྲྭ་རྒྱ་ལ་མཆན་]རྒྱབ་ཐུབ་པའི་འཆར་གཞི་ཡོད། (https://gitlab.com/fdroid/fdroid-website/issues/36) འདིས་ང་ཚོ་[མཉེས་ཆས་གཅིག་ལ་མཆན་རྒྱབ་ཐུབ་པར་།]ཐག་ཉེ་རུ་བཏང་གི་ཡོད། (https://gitlab.com/fdroid/fdroidclient/issues/646).
es: Finalmente, una última observación sobre el desarrollo actual de F-Droid: planeamos usar Discourse para los [comentarios en el sitio web](https://gitlab.com/fdroid/fdroid-website/issues/36), un primer paso para acercarnos a los [comentarios por cada aplicación](https://gitlab.com/fdroid/fdroidclient/issues/646).
nb_no: Til sist er det en siste innsikt i den nåværende utviklingen av F-Droid å ta med seg: Vi planlegger å bruke Discourse for [kommentarer på nettsiden](https://gitlab.com/fdroid/fdroid-website/issues/36) som bringer oss nærmere [kommentarer på enkeltprogrammer](https://gitlab.com/fdroid/fdroidclient/issues/646).
zh_hant: 最後, F-Droid 目前開發情況有最新的消息: 我們打算要使用 Discourse 來作[網站的評論區](https://gitlab.com/fdroid/fdroid-website/issues/36)，以便於了解用戶[對於某一個應用的評論](https://gitlab.com/fdroid/fdroidclient/issues/646).

source: Make sure you keep an eye on the new developments happening to F-Droid in 2017. We for our part are curious if you like the new forum.
bo: ཕྱི་ལོ་ ༢༠༡༧ ལོར་ཨེཕ་རོཌ་ནང་ཡར་རྒྱས་གོང་སྤེལ་གསར་པ་བཏང་ཡོད་པ་དེ་ལ་ཐུགས་སྣང་ངེས་པར་དུ་གནང་རོགས། ང་ཚོའི་ངོས་ནས་ཀྱང་ཁྱེད་རྣམ་པས་གླེང་སྟེགས་གསར་པ་དེར་དགའ་མོས་བྱུང་མིན་ཤེས་འདོད་འདུག
es: Mantén un ojo en los desarrollos de F-Droid que tendrán lugar durante 2017. Por nuestra parte, tenemos curiosidad por saber si te gusta el renovado foro.
nb_no: Hold et øye med ny utvikling av F-Droid i 2017. Vi er spente på hvordan du liker det nye forumet.
zh_hant: 請持續關注 F-Droid 在2017的最新發展，我們想知道用戶是否喜歡這個新的論壇。
