{
    "misc": {
        "step_x": "Шаг [number]",
        "step_x_description": "Шаг [number]: [description]",
        "option_x_description": "Вариант [number]: [description]",
        "overview": {
            "title": "Что можно сделать при помощи F-Droid",
            "summary": "F-Droid — независимый, разрабатываемый сообществом магазин приложений для Android со свободным и открытым исходным кодом. При помощи F-Droid можно просматривать более 1200 приложений с открытым исходным кодом, искать и устанавливать приложения из имеющихся репозиториев или же создать собственный репозиторий. Чтобы начать, откройте f-droid.org на своём устройстве с Android и загрузите приложение!",
            "tutorial_x_title": "Руководство [number]: [title]"
        }
    },
    "add_repo": {
        "overview": {
            "title": "Получить больше.",
            "summary": "Чтобы получить больше, добавьте в F-Droid репозиторий. Репозиторий — курируемый набор содержимого. Узнать о репозиториях отдельных людей можно непосредственно от них самих. Разработчики на своих сайтах зачастую добавляют ссылку на свои репозитории F-Droid. Преподаватели зачастую делятся ссылками на репозитории через E-mail, Facebook или Twitter."
        },
        "title": "Как добавить репозиторий в F-Droid",
        "intro": "Для добавления желаемых репозиториев с устройств или сайтов сосканируйте искомые коды QR.",
        "open_repo_link": {
            "short_summary": "Открытие ссылки на репозиторий",
            "title": "Открытие ссылки на репозиторий со своего устройства",
            "description": "При получении ссылки через E-mail, социальные сети или SMS, откройте её и получите возможность устанавливать приложения в F-Droid из неё.",
            "steps": {
                "step_1": "Загрузите и установите приложение F-Droid на своё устройство с Android.",
                "step_2": "Перейдите по ссылке и откройте её в веб-браузере на своём устройстве.",
                "step_3": "После перехода по ссылке коснитесь кнопки \"Добавить в F-Droid\".",
                "step_4": "Коснитесь кнопки \"У меня есть F-Droid\". Откроется приложение F-Droid.",
                "step_5": "Появится экран \"Добавить новый репозиторий\" с заполненным адресом репозитория. Чтобы его добавить, коснитесь кнопки \"OK\".",
                "step_6": "Будет добавлен новый репозиторий. Чтобы увидеть список своих репозиториев, откройте \"Настройки\". Выберите \"Репозитории\".",
                "step_7": "Чтобы увидеть содержание репозитория, коснитесь его названия.",
                "step_8": "Выберите желаемые приложения и установите их себе на устройство."
            }
        },
        "scan_qr_code": {
            "short_summary": "Сканирование кода QR",
            "title": "Сканирование кода QR с другого устройства",
            "description": "Для добавления желаемых репозиториев с устройств или сайтов сосканируйте искомые коды QR."
        }
    }
}
