{
    "misc": {
        "step_x": "Þrep [number]",
        "step_x_description": "Þrep [number]: [description]",
        "option_x_description": "Valkostur [number]: [description]",
        "overview": {
            "tutorial_x_title": "Leiðbeiningar [number]: [title]",
            "title": "Hvað geturðu gert með F-Droid",
            "summary": "F-Droid er sjálfstætt, samfélagsdrifið hugbúnaðarsafn fyrir Android sem inniheldur einungis frjálsan og opinn hugbúnað. Innan F-Droid getur þú flett upp yfir 1,200 forritum með opnum grunnkóða, leitað að og sett upp forrit úr þegar tilbúnum hugbúnaðarsöfnum, eða búið til þitt eigið hugbúnaðarsafn. Opnaðu f-droid.org á Android símanum þínum til að sækja forritið/appið og hefjast síðan handa!"
        }
    },
    "add_repo": {
        "overview": {
            "title": "Ná í meira efni.",
            "summary": "Til að ná í fleiri forrit geturðu bætt hugbúnaðarsafni (repository - repo) við F-Droid. Hugbúnaðarsafn er safn yfirfarins efnis, forrita eða annarra gagna. Þú getur uppgötvað hugbúnaðarsöfn annars fólks beint frá þeim. Forritarar eru gjarnan með tengil á F-Droid safn á vefnum sínum. Þjálfarar og kennarar deila oft tenglum á hugbúnaðarsöfn með tölvupósti, Facebook eða Twitter."
        },
        "no_internet": "Ekkert internet? Ekki vandamál. Lestu um <a href=\"../swap/\">Hvernig á að senda og taka við forritum án nettengingar.</a>",
        "title": "Hvernig á að bæta hugbúnaðarsafni við F-Droid",
        "open_repo_link": {
            "short_summary": "Opnaðu tengilinn á hugbúnaðarsafnið",
            "title": "Opnaðu tengilinn á hugbúnaðarsafnið í símanum þínum"
        },
        "scan_qr_code": {
            "related_tutorial": "Þú gætir líka haft áhuga á: <a href=\"../swap/\">Hvernig á að senda og taka við forritum án nettengingar</a>",
            "short_summary": "Skanna QR-kóða",
            "title": "Skannaðu QR-kóða frá öðru tæki"
        }
    },
    "swap": {
        "overview": {
            "title": "Senda og taka við forritum án nettengingar."
        },
        "related_tutorial": "Þú gætir líka haft áhuga á: <a href=\"../create-repo/\">Hvernig á að búa til hugbúnaðarsafn</a>",
        "step_5": "Ýttu á '—>' hnappinn.",
        "title": "Hvernig á að senda og taka við forritum án nettengingar"
    },
    "create_repo": {
        "overview": {
            "title": "Bæta við þínum eigin forritum og skrám."
        },
        "related_tutorial": "Þú gætir líka haft áhuga á: <a href='../add-repo/'>Hvernig á að bæta hugbúnaðarsafni við F-Droid</a>",
        "update_repo": {
            "title": "Uppfærðu hugbúnaðarsafnið þitt"
        },
        "customize_repo": {
            "steps": {
                "step_2": "Smelltu á 'Breyta'."
            }
        },
        "title": "Hvernig á að búa til hugbúnaðarsafn"
    }
}
